[
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "NAF Technology India",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Position Summary:    Do you love a Challenge? Are you Passionate about technology? Are you customer obsessed? Looking to innovate? Join NAF Tech!  New American Funding(NAF) is a mortgage lender offering an array of loan options. Established in 2003 and headquartered in Tustin, CA, United States, NAF has 4400+ strong work-force across 167 branches and a servicing portfolio of 229,000+ loans and $60.7 Billion.  By having a clear understanding of product requests, collaborating with our product teams and designers, and providing solutions to our business problems, this role will provide insights in our development efforts. We're expecting this candidate to be able to make independent decisions, and use their creativity to solve different problems, and most important of all, have fun with the team here!  Responsibilities:  Define the long-term technical strategy and architecture vision for device management, leveraging new technologies to deliver features to our customers. Think out of box, plan and build frameworks as building blocks, be updated with the technology and improve frameworks on timely manner Analyse User requirements, clarify and cascade as needed for clear understanding and implementation Professionally maintain all software and create updates regularly to address customer concerns Troubleshoot coding problems quickly and efficiently to ensure a productive workplace Ensure software security by developing programs to actively monitor the defined standards Collaborate with team members to determine best coding practices and enhance client experience Develop Successors in Place by mentoring the individuals and assist in their career growth and update them with the technical challenges that might come their way Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts and code comments Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment Actively participate in Internal initiatives, contribute to org wide Technology initiatives  Core Competencies:  Bachelor’s Degree in Computer Science or equivalent Overall, 5+ years of Software development experience 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems Strong C/S Foundation and competencies on Data Structures, Algorithms and Software Design Principles supporting multiple channels. Proficiency in either of these - C#, VB.Net, ASP.net, React and AngularJS, HTML5, CSS3, SASS Proficiency in Angular 12, NGRX, C# Azure AppService and Functions, Cosmos DB, Blob Storage, ElasticSearch, SQL Server is a plus.Integration expertise working with third-party libraries and APIs Possess expert knowledge in performance, scalability, enterprise system architecture, and engineering best practices. Knowledge in latest Architectural patterns that facilitates TDD approach, Knowledge in Unit Testing Experience in being part of Production deployments and related activities Ability to work in Agile fast paced environment with knowledge on CI/CD /Monitoring frameworks and related DevOps tools (Jenkins,Jira,Google Analytics if any) Proficient in Problem solving Ability to work as part of Team or as Individual contributors Excellent communication and interpersonal skills working across multiple geographies  Nice to Have:  Optimize Applications/Frameworks to maximize speed and scale Working Knowledge of Django, Flask and React.JS Proficient in Relational Databases querying A Deep understanding of cross functional teams and working across the teams Ability to handle Aggressive timelines and achieve optimal solutions to the Business requirements.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Securin Inc.",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Requirements for Java DeveloperAt least 5-8 years of work experience as a Java Developer or any similar role.Experience with Object-Oriented Design. And In-depth knowledge of popular frameworks like Spring Boot, JPA, Spring Batch etc.,Familiar with SQL or Search like MySQL, and Elastic SearchExperience with large and disparate data set.Creating Web Services and RESTful services with Web API.Familiar with Open Source tools and good to have experience with Amazon Web Service (AWS).Familiar with Caching Solution like RedisGood to have Containerization skills and working with CI CD pipeline\nResponsibilities \nImplementing modernized application design and testing features before release.Hands-on experience in developing software with agile or scrum methodologies.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer (Entry Level)",
    "companyName": "MRI Software",
    "location": "Bangalore Rural, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  We are currently seeking a Junior Software Engineer to work within our global Product Development department working to apply defined software development life cycle processes to deliver production ready code of the highest quality, this individual will be diligent in testing their code and working with the team to produce\nMRI Software’s high standard product. This individual will work under the Agile development methodology in a cross-functional environment with other groups, both inside and outside the department including Product Management and Documentation, as well as create and test code in our dynamic team setting\nResponsibilities\nApplies defined practices and procedures to design, implement, and support software projectsBuilds effective working relationships with team membersActively seeks assistance as needed but demonstrates learning and growing independenceActively seeks guidance for prioritization and review of deliverables.Performs and designs testing protocols to ensure that the product is fully tested.\nRequirements\nCurrently pursuing a BE, Btech, MCA, MSC, or BCA Computer Science or related technical field (2022 Passout may also apply)Experience developing software or algorithms based on predetermined specificationsKnowledge of object-oriented programming, Microsoft .Net or Java preferredProficient with Source Control tools Familiarity with database objects (tables, stored procedures, queries, etc.) a plusAttention to detail is a mustGood written and verbal communication skills\nBenefits\nAbility to learn leading technical / industry standards and technologiesFlexible working arrangements (2 days in the office)Annual performance-related bonusHealth insurance6x Flexi Fridays: knock 2.5 hours off your day on a FridayEngaging, fun & inclusive culture: check out the MRI Software APAC Insta feed and stories!\nAbout The Business\nMRI Software is a global Proptech leader delivering innovative applications and hosted solutions that free real estate companies to elevate their business. \nOur flexible technology platform, along with an open and connected ecosystem, allows us to meet the unique needs of real estate businesses, from property-level management and accounting, to investment modeling and analytics for the global commercial and residential markets. With nearly five decades of expertise and insight, we have grown to include offices in across the United States, the United Kingdom, Hong Kong, Singapore, Australia, South Africa, New Zealand, Canada, and India, with over 3000 team members to support our clients and their unique needs!\nMRI is proud to be an Equal Employment Opportunity employer.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "CM.com",
    "location": "Greater Bengaluru Area, On-site",
    "description": "About the job\n        \n\n\n        \n                  The Challenge\nToday, people all over the world are connected. All day, every day. At CM.com we firmly believe that technology exists to enhance people’s lives. We enable our customers to be part of those lives. Constantly searching for ways to better connect people with each other is what drives us.To help us achieve this mission we are looking for an enthusiastic software engineer to help build our R&D hub in India.\nAs a software engineer at our India office in Bangalore, you will be part of the Connect team that takes the product from a Proof of Concept phase, to the market and to a mature product. The result will be that the Connect product is a mission critical integration into the marketplace. At CM.com we have over 300 people working in our R&D department divided over 25+ agile teams. \nThe productMany of our Payments, Messaging or SaaS products require integrations with external platforms (like Salesforce or Microsoft Dynamics) to truly maximize the value that our customers get out of their product. From Conversational A.I. Chatbots that communicate with ERPs, to a contact center application getting data from an order system, to CRMs that post records to our Customer Data Platform.To avoid a complex web of point solutions, we are launching a new product: CM Connect.  External platforms integrate with CM Connect once, after which the data contracts, authentication and authorization automatically cascade to multiple CM products.\nWhat you offerBachelor’s / Master’s degree in computer science / IT.4 to 8 years’ experience in overall software product development. Preferably in the Cloud/SaaS/Enterprise sectorExpert in C#, preferably with knowledge of the latest .Net 5 and 6 frameworksExperience defining and developing web service API’sAgile and Test driven development methodologiesExcellent verbal and written communication skills with a strong eye for detail\n\nWhat we offerA challenging job within an innovative and international fast-growing company. We are the fastest growing CPaaS company in 2022The opportunity to shape your job with your own skillsAwarded to be a Great Place to Work in 2021 & 2022 by CM.com employeesWorking together with motivated and entrepreneurial colleaguesOnboarding and buddy program to help you to get up to speedPlenty of opportunity for personal and professional growth through courses and training, by among others the CM Academy\nCM.com as a CompanyCM.com is a listed company (Euronext Amsterdam: CMCOM) and provides Conversational Commerce services from its cloud platform that connects enterprises and brands to the mobile phones of billions of consumers worldwide. Conversational Commerce is the convergence of messaging and payments.CM.com has over 1000 employees and 23 offices globally. The CM.com India office is in Bangalore and its headquarters is in Breda. In the Netherlands we have offices in Amsterdam, Utrecht, Arnhem, Enschede and Maastricht.\nApply now and ‘Start the ConversationAre you the candidate we are looking for? Please apply via our company website with your resume and tell us what excites you about this opportunity. The interview process will have four interviewing rounds.\nWe look forward to hearing from you.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Ciber Global",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Position Description: Enhance existing Odyssey application using - JBOSS/Struts/EJB/JMS/Hibernate/ORM/JPA/Servlet/JSP/Angular/XML/XSLT/FOP/XEP/Apache/Rabbit MQ/Restful /Oracle DB - Has good knowledge on using CID-CD/Dev tools like Jenkins/Github/Gradle/Sonar/Checkmarx/Junit/Mokito/Selenium/Lombok - Develop new microservice-based application software using Java, Spring Framework/Spring boot/GCP/Tekton/ PostGreSQL - Contribute to feature and user story development / backlog refinement as part of the team’s Agile methodology. - Collaborate with other product teams on integrations, testing, and deployments - Improve application testing capabilities by implementing automated testing tools and best practices, writing Junit test cases. - Monitor and evaluate the performance of our solutions; support the production application and identify improvement opportunities  Skills Required: JAVA 8/11, Spring boot, PCF (Pivotal cloud foundry), Google Cloud Platform (GCP), Microservices, REST/SOAP, Gradle, CI/CD pipeline, MS SQL, Oracle, PostGreSQL, noSQL, Kafka, RabbitMQ, GitHub, Dynatrace, Splunk, reactjs  Skills Preferred: Successful candidate will have: - Strong analytical and problem-solving skills - Strong focus on quality practices - Good communication and interpersonal skills - Ability to multi-task and manage changing priorities - Ability to work independently and take initiative when facing unexpected problems - Leadership skills   Experience Required: - Overall 3-12 years of Java development experience - 3+ years of experience as a Java developer with good OOPS background - 3+ years of experience in Java development using Spring, Spring Boot - 3+ years of experience in Junit testing - 3+ years of experience in cloud microservices development (GCP, REST services, YML, PCF) - Experience with test-driven development / JUnit and pairing/mobbing practices - Familiarity with GitHub or equivalent source control repositories - Experience with CI/CD processes and tools (e.g., Jenkins) - Knowledge of build tools (e.g., Gradle) - Expertise with Oracle, and PostGreSQL; experience with NoSQL databases (MongoDB) nice to have - Experience troubleshooting application and performance issues; use of tools like Splunk , Dynatrace. - Good to have knowledge in legacy Java technologies like Struts, JSP, Servlet etc..",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Light & Wonder",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Gaming:\nWelcome to the world of land-based gaming. Light & Wonder’s gaming team builds cutting-edge technology, products, and content for the most iconic casinos and operators across the globe.\nPosition Summary\nJob Description\nSoftware Development Engineer: Plans, designs, develops and tests software systems or applications for software enhancements and new products including cloud-based or internet-related tools. Most companies should be able to match to a specific software development engineer position. Use this position if company does not breakout software development positions such as Software Engineer (Applications) (5141-5146) or Software Engineer (Systems) (5161-5166).\nSupervisory Responsibilities\nThis position has no supervisory responsibilities.\nJob Level Description\nWorks on defined tasks that sometimes require the application of independent judgment. Developing individual contributor.\nQualifications\nEducation\nBachelors degree in related field.\nYears Of Related Experience\nYears of experience 2 to 5 years\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit, stand, walk, bend, use hands, operate a computer, and have specific vision abilities to include close and distance vision, and ability to adjust focus working with computer and business equipment.\nWork Conditions\nScientific Games Corporation and its affiliates (collectively, “SG”) are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due diligence/background investigation on you.\nThis job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer (Backend)",
    "companyName": "Meltwater",
    "location": "Coimbatore, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Meltwater offers comprehensive media monitoring and analysis across online news, print, broadcast, podcasts, and social media, capturing more content and conversations than anyone else in the industry.\n\nThe team consists of 12 engineers organized as 3 pods distributed between India and Europe. The team is responsible for all NLP operations at Meltwater, serving more than 15B inferences per day across 200 languages and 10+ NLP tasks. Our tech stack is: AWS, Kubernetes, Terraform, TensorFlow, Python, and Java.\n\nThe team is seeking a Senior Software Engineer (with DevOps experience) who wants to grow in an organization based on collaboration across team and country boundaries. With the massive production scale of our systems, small decisions you make may have a big impact on our product and our many customers.\n\nOur culture is based on a fundamental belief in people with a passion for learning new things and a desire to help those around you. We are strong believers in team autonomy, DevOps culture and continuous delivery. Meltwater development teams fully own and operate their subsystems, infrastructure, and run on-call rotations.\n\nRequirements\nAt least 4 years’ experience in Software Engineering and DevOps. Proficient in Java with strong knowledge of JVM internals. Working knowledge of Python Understanding of AWS services for distributed data and message processing (e.g., Route53, S3, SQS, Athena, EC2) Demonstrable knowledge and skills with Kubernetes Deployment or operationalizing large-scale distributed data processing systems Terraform and Apache Kafka experience is a bonus.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead Software Engineer",
    "companyName": "HERE Technologies",
    "location": "Bengaluru East, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  What's the role? \nAs a Lead Software Engineer, you'll have the opportunity to work on this amazing product. Within the cross-functional and self-organized team, you’ll have fun working on systems under huge load and storing a vast amount of data in the very heart of our platform - the Delivery Platform. These services are mission-critical and meet demanding compliance, security, performance, and uptime requirements. You will help run it on production with full control and responsibility. Your role encompasses defining and working on features and technical tasks in a self-directed fashion, supporting your colleagues with technical challenges, working with product management to analyse requirements, talking to stakeholders, designing, implementing, and documenting solutions as well as testing and reviewing your colleagues' work.\nTeam Shared Responsibilities\n architecture, design, develop, test the backend components  evaluate and choose technologies suitable for work  elaboration and refinement of user stories  development infrastructure (build, testing, continuous integration, delivery)  run, monitor, and support in production, ensure our customers receive world-class service by periodically participating in 24x7 on-call shifts  team ceremonies (planning, demo, triage, retrospective)  communicate effectively about decisions, direction, and progress, both inside and outside the team \n Who are you? \nAn ambitious team-player who has experience developing and deploying production-grade services. You have experience with the production software lifecycle, as well as deployment of software to production ready, stable environments. You have 7+ years of professional software development and deployment experience including knowledge of continuous integration, continuous delivery, and automated testing disciplines. You also have good interpersonal skills and feel comfortable coordinating across teams in multiple design centres.\n Bachelor/Masters in a technical degree like C.S. or technical management  Strong programming skills with 7 plus years of experience; Python experience required  Experience with cloud-based technologies (e.g. AWS, Azure, GCP, OCI)  Experience with Kubernetes  Knowledge with distributed systems; Docker, Terraform, Puppet are desired  Experience with deployment automation systems (e.g. Jenkins, Gitlab, etc.)  Interest in high throughput, low latency, highly reliable systems at scale  Interest in DevOps methodologies to drive throughput and stability  What we offer \n Cutting-edge technology environment  Challenging real-world problems to solve  Work that makes a difference in the world  Freedom to decide how to perform your work  Variety in the types of projects  Variety of Learning & Development options.  Collaborative and encouraging Colleagues. \nHERE is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\nMake HERE your destination, we are just getting started. Apply now!\n Who are we? \nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us. Watch Video\nHERE is looking for Lead Software Engineers to join its fast-growing and highly motivated Delivery Platform team. The Delivery Platform team is responsible for providing the enabling layers to the HERE Platform through identity and access management, accounting, billing, container orchestration, cloud abstraction, big data management, processing, and streaming services. The Delivery Platform services are mission-critical and meet demanding compliance, security, performance, and uptime requirements.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer I",
    "companyName": "Eventbrite",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and event goers need new tools and technologies that empower them to have the most meaningful live experiences. As a Software Engineer at Eventbrite, you will build beautiful, responsive, delightful and intuitive user interfaces that people are excited to use\nTHE TEAM\nWe're a people-focused Engineering organization: the women and men on our team value working together in small teams to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. Pair programming, weekly demos, tech talks, and quarterly hackathons are at the core of how we’ve built our team and product. We believe in engaging with the community, regularly hosting free events with some of the top technical speakers, and actively contributing to open source software (check out Britecharts as an example!). Our technology spans across web, mobile, API, big data, machine learning, search, physical point of sale, and scanning systems. To learn more about some of the frontend teamwork, check out our frontend blog\nTHE SKILL SET\nAdvanced English Level1-2 years of experience working in a Software Development role Experience with or the excitement to work with Python and Django web frameworkUnderstanding that great code is also maintainable codeYou care about making sure your code is well testedA result driven self starter with great communication and collaboration skillsUnit-testing know-how required, experience with TDD or BDD is an added bonusKnowledge of front-end technologies (HTML, CSS, Ajax, Javascript)Database experience (ideally MySQL, NoSQLis a plus)OOP/OOD knowledge\nBONUS POINTS\nExperience with AWS and developing APIsExperience using non-relational databasesFamiliarity with Eventbrite and a passion for live events\nWhat We Offer\nAt Eventbrite, we strive to support our Britelings and their loved ones through different stages of life with robust and attractive benefits, financial and physical wellness options, and great perks. In addition to offering a competitive salary and company stock, we have other great benefits available. In the Briteland, you’ll find great medical plans, fertility and adoption benefits, wellness reimbursement, generous parental leave, and much more.\nWe Care About Your Mental Health And Wellbeing.\nOur employees enjoy free coaching sessions with Modern Health. We also offer free therapy sessions with a psychologist. You’ll also have access to private medical insurance for you and your family, that includes dental care. And our wellness program to pay for your gym expenses.\nWe work hard to cultivate a diverse, equitable and inclusive culture where Britelings feel like they belong.\nEmployees can participate in resource groups and we offer programming throughout the year to support a diverse and inclusive workplace.\nWe offer ongoing training and career development that meets people where they are in their careers.\nWe offer unlimited access to courses in Udemy, leadership coaching for all managers, Briteling led talks, and weekly company-wide town halls with our CEO. We take culture seriously and design programs with employee feedback in mind to make Eventbrite a great place to work no matter where you work from in the world.\nWork-life balance & flexibility is extremely important to us.\nOur employees can choose what works best for them: work in one of our offices, be fully remote or the best of both worlds! We believe in a flexible working environment to allow Britelings to perform at their best ensuring a healthy work-life balance. We have recently implemented Britebreak Fridays: all Britelings turn off their computers and take the first Friday of every month off to focus on their wellbeing.\nAbout Eventbrite\nEventbrite is a global self-service ticketing and experience technology platform that serves a community of hundreds of thousands of event creators in nearly 180 countries. Since inception, Eventbrite has been at the center of the experience economy, transforming the way people organize and attend events. The company was founded by Julia Hartz, Kevin Hartz and Renaud Visage, with a vision to build a self-service platform that would make it possible for anyone to create and sell tickets to live experiences. The Eventbrite platform provides an intuitive, secure, and reliable service that enables creators to plan and execute their live and online events, whether it’s an annual culinary festival attracting thousands of foodies, a professional webinar, a weekly yoga workshop or a youth dance class. With over 290 million tickets distributed for over 5 million total events in 2021, Eventbrite is where people all over the world discover new things to do or new ways to do more of what they love. Learn more at www.eventbrite.com .\nIS THIS ROLE NOT AN EXACT FIT?\nSign up to keep in touch and we’ll let you know when we have new positions on our team .\nEventbrite is committed to equality of opportunity for all staff, and applications from all suitably qualified individuals are encouraged, regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.\nApplicant Privacy Notice",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Sr Software Engineer",
    "companyName": "Zuora",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  OUR VISION: THE WORLD. SUBSCRIBED.\nCustomers have changed. They’re looking for new ways to engage with businesses. Consumers today have a new set of expectations. They want outcomes, not ownership. Customization, not generalization. Constant improvement, not planned obsolescence.\nIn the old world (let’s call it the Product Economy) it was all about things. Acquiring new customers, shipping commodities, billing for one-time transactions. But in today’s new era, it’s all about relationships. More and more customers are becoming subscribers because subscription experiences built around services meet consumers’ needs better than the static offerings or a single product.\nOur vision is “The World Subscribed” where one day every company will be a part of the Subscription Economy® (a phrase coined by our CEO, Tien Tzuo, and author of the best-selling book Subscribed).\nAs consumers wave goodbye to ownership, join us as we help companies win on their journey to usership!\nTHE TEAM\nModern finance leaders are looking for new ways to strategically advise their business and ultimately scale revenue growth. But as they adopt increasingly complex pricing models incorporating a mix of subscriptions, one-time, and usage-based offers, their financial close process has become more resource-intensive, prone to human error, and can span weeks.\nWith Zuora Revenue, businesses can not only automatically recognize, reconcile, and analyze revenue in real-time, but they can accurately close the books as early as Day 0, while easily forecasting their revenue targets.\nYou read more about it at https://www.zuora.com/products/revenue/\nTHE OPPORTUNITY (AKA: Why you want this role over any other out there) \nWe are looking for a Sr Engineer who is self-motivated to design, develop, test, and operate cutting-edge, large scalable, and enterprise SaaS applications.\nOur Tech Stack: Java, Spring, Rest API, Microservices, Kafka, AWS, Kubernetes, Terraform, Apache Pinot, AngularJS, Oracle, PL/SQL, Jenkins\nWhat You’ll Achieve\nEnable scrum teams to be successful by designing & building DevOps tools and CI/CD pipelines to meet the delivery and quality commitmentsPlan, design and implement the right tooling for the operation of large scale enterprise SaaS applicationsHelp the team achieve the bold goal of every commit reaching production post quality gates.Help with Zuora’s transition to micro-service and cloud-based architecture.Raise the bar on engineering practices and code quality.\nWhat You’ll Need To Be Successful\nBTech/BE/BS/MS/PHD in Computer Engineering discipline or relevant degree. 10+ years of experience specializing in Dev/ops for enterprise SaaS products Self-starter who is able to make a large impact with minimal supervision.Proficiency with AWS Services including Lambda, EC2, ECS, EMR, S3, Cloudwatch.Strong in scripting languages such as Python, Groovy etcHands-on experience with build engineering tools such as Gitlab, Jenkins, docker, chef, or similar (Ability to learn new tools)Hands-on experience with modern container orchestration services such as K8’s/ ECS etc.Knowledge of Oracle, and PL/SQL will be an advantageExcellent Problem Solving and communication skills.\nWhat are the benefits of working at Zuora?\nEmployee Stock Purchase PlanMedical Coverage and Parental Leave Carrer cash to keep yourself updatedRefresh/wellness holidays along with standard time offOur campus includes a game area along with a well-stocked pantry\nAbout Zuora & Our “zeo” Culture\nZuora (NYSE: ZUO) Zuora provides the leading cloud-based subscription management platform that functions as a system of record for subscription businesses across all industries. Powering the Subscription Economy®, the Zuora platform was architected specifically for dynamic, recurring subscription business models and acts as an intelligent subscription management hub that automates and orchestrates the entire subscription order-to-revenue process seamlessly across billing and revenue recognition. Zuora serves more than 1,000 companies around the world, including Box, Ford, Penske Media Corporation, Schneider Electric, Siemens, Xplornet, and Zoom.\nAt Zuora, we have one CEO but every employee is empowered and supported to be the ‘ZEO’ of their own career experience. By embedding inclusion and belonging into our processes, policies and culture, we are building a workplace where our 1,200+ ZEOs across North America, Europe, and APAC can bring all the elements of who they are into their work. In addition to an industry-leading six-month, 100% paid parental leave for all our ZEOs, we also offer programs to support your mental health and give back to our communities along with “career cash” and plenty of learning and development opportunities.\nTo learn more visit www.zuora.com\nZuora is proud to be an Equal Employment Opportunity Employer.\nWe believe the Subscription Economy has the power to make the world a better place by broadening access, increasing inclusion, and bolstering sustainability. At Zuora, we’re creating a culture that every ZEO wants to subscribe to. We achieve our vision and mission for diversity and inclusion through our framework ONE ZUORA: Inspiring Innovation through Inclusion.\nZuora does not discriminate on the basis of, and considers individuals seeking employment with Zuora without regards to, race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics.\nZuora is proud to be an Equal Opportunity Employer committed to creating an inclusive environment for all. We encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)zuora.com.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Victoria's Secret",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Description\nPurpose & Overview:\nDevelop, troubleshoot, debug and implement Salesforce.com and Force.com applications. Deliver innovative, high quality solutions to customers. Our Salesforce developer will have strong enterprise business application development. This position will work as part of a development team using rapid development practices.\nResponsibilities & Qualifications:\n Requires a bachelor’s degree (preferably in Computer Science) and 6 – 8 years of IT experience and at least 4 – 5 years of Force.com development experience, with a strong focus on Apex and lightning development. Expertise in lightning aura component development. Web component knowledge preferred. Strong expertise on salesforce point and click tools – Schema Builder, Process Flows, Approval Flows, Visual Work Flows, etc. Strong expertise on salesforce custom development – APEX Classes, APEX triggers, Asynchronous Processing – Batch Apex, Queueable Apex, Future Methods, Scheduled Apex Strong expertise in OOPs concepts and patterns Good Knowledge on Salesforce Application Design Patterns and integration patterns. Experience with integrating salesforce with other systems Experience on various SF products and thorough understanding of their architectures Configuration experience with standard and custom Salesforce objects and fields. Strong Knowledge on web development technologies - HTML, JavaScript, and CSS. Strong oral and written communication skills. Ability to work independently and as part of a team.\nQualifications\nQualifications – External\n Experience in continuous integration and version management tools like GIT hub Salesforce Lightning Web Components knowledge Knowledge on React JS or any JS framework. Salesforce DX Experience with Salesforce Lightning Connect Salesforce Platform Developer 2 Certification",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "SailPoint",
    "location": "Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  SailPoint is seeking a Backend Software Engineer to help build a new cloud-based SaaS identity analytics product. We are looking for well-rounded backend or full stack engineers who are passionate about building and delivering reliable, scalable microservices and infrastructure for SaaS products. This is a unique opportunity to build something from scratch but have the backing of an organization that has the muscle to take it to market quickly, with a very satisfied customer base. \n\nResponsibilities Deliver efficient, maintainable, robust Java based microservices. Produce designs and rough estimates, and implement features based on product requirements. Collaborate with peers on designs, code reviews, and testing. Produce unit and end-to-end tests to improve code quality and maximize code coverage for new and existing features. \n\nRequirements 2 to 5 years Expert in Core Java Web Service architectureSOAP & REST based Experience in any Databases like Oracle, MSSQL and Sybase Good hands-on experience on XMLJSON Experience in Any Application server - Tomcat, JBoss, Weblogic ,WebSpherStrong Java experience Great communication skills BS in Computer Science, or a related field Proficient experience with object-oriented analysis and design skills Proficient experience with an object-oriented programming language and techniques Proficient understanding of Java Frameworks \n\nPreferred Experience with AWS Exposure to Cloud ServicesExperience with Continuous Delivery UI technologies – Web Tool Kits like ExtJSExperience instrumenting code for gathering production performance metrics Design Patterns and usage\n\nSailPoint is an equal opportunity employer and we welcome everyone to our team. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "SailPoint",
    "location": "Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  SailPoint is seeking a Backend Software Engineer to help build a new cloud-based SaaS identity analytics product. We are looking for well-rounded backend or full stack engineers who are passionate about building and delivering reliable, scalable microservices and infrastructure for SaaS products. This is a unique opportunity to build something from scratch but have the backing of an organization that has the muscle to take it to market quickly, with a very satisfied customer base. \n\nResponsibilities Deliver efficient, maintainable, robust Java based microservices. Produce designs and rough estimates, and implement features based on product requirements. Collaborate with peers on designs, code reviews, and testing. Produce unit and end-to-end tests to improve code quality and maximize code coverage for new and existing features. \n\nRequirements 2 to 5 years Expert in Core Java Web Service architectureSOAP & REST based Experience in any Databases like Oracle, MSSQL and Sybase Good hands-on experience on XMLJSON Experience in Any Application server - Tomcat, JBoss, Weblogic ,WebSpherStrong Java experience Great communication skills BS in Computer Science, or a related field Proficient experience with object-oriented analysis and design skills Proficient experience with an object-oriented programming language and techniques Proficient understanding of Java Frameworks \n\nPreferred Experience with AWS Exposure to Cloud ServicesExperience with Continuous Delivery UI technologies – Web Tool Kits like ExtJSExperience instrumenting code for gathering production performance metrics Design Patterns and usage\n\nSailPoint is an equal opportunity employer and we welcome everyone to our team. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Light & Wonder - iGaming",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Company Description\n\nLight & Wonder is the global leader in cross-platform games and entertainment. We build new worlds of play, game experiences loved by players around the globe, powered by the world's largest and most trusted ecosystem. We are creators who are passionate about delivering the best digital experiences to players.\n\nThe iGaming division has undergone a period of transformation over the past 12 months and today employs 1,100 employees across the globe, serving over 200 customers with more than 3,000 games worldwide. We have recently acquired 4 businesses and are an exciting, fast paced journey ahead. We have a strong people-based culture, which encourages everyone to be bold, own opportunities and strive to build better, in everything we do.\n\nAdditional Information\n\nWhy would you enjoy working with us at Light & Wonder?\nCompetitive benefits, an open and supportive environment as well as a modern and exciting workplaceThe opportunity to interact with global teams on a regular basisTangible and genuine development - at Light & Wonder, you can take your career where you want it to go!\n\nAnd if that’s not enough; you will get to enjoy a stunning work location and flexible working practices whilst we provide you with the guidance and development skills you need to progress quickly and enhance your career.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Blackhawk Network",
    "location": "Kozhikode, Kerala, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  About Blackhawk Network\n\nRybbon, a Blackhawk Network Company, is looking for a talented and motivated software engineer with a passion for solving challenging problems and building products that customers love.\n\nThis is a great opportunity to join a Rybbon, Blackhawk Network company that is changing how businesses put the power of gifting to work.\n\nWho We Are\n\nRybbon is a platform for marketers to send & manage global e- gift campaigns like Amazon or Visa e-gift cards. Marketers love how Rybbon makes it easy to deliver gifts to hundreds and thousands of recipients. Rybbon is the only integrated gifting partner for the top marketing & survey platforms - SurveyMonkey, Marketo, HubSpot, and Qualtrics.\n\nRybbon has grown rapidly to more than 1000 customers with 5-star ratings on G2 Crowd and Capterra. Rybbon Division of Blackhawk is based in Washington DC, USA, and in Calicut, Kerala, India. Learn more about Rybbon at www.rybbon.net .\n\nRybbon was acquired by Blackhawk Networks in August 2021, a global leader in branded payments.\n\nAt Blackhawk Network, we shape the future of global branded payments through prepaid products, technologies, and networks that connect brands and people. Our collaborative innovation and scalable, security-minded solutions help our partners to increase reach, loyalty, and revenue. We believe our future holds great things for Blackhawk Network and its partners. We believe that together, we can shape the future. Our beliefs? Win as one team, be innovative, have global excellence, and be inspiring! Blackhawk is a multi-billion dollar US-based corporation, with headquarters in Pleasanton, California, and offices in over 28 countries.\n\nSo, what are you waiting for? Shape your career and join our global network.\n\nOverview\n\nBlackhawk Network is building a digital platform and products that unite people and brands. We facilitate cross-channel payments via cash-in, cash-out, and mobile payments. By leveraging blockchain, smart contracts, serverless technology, and real-time payment systems, we are unlocking the next million users through innovation.\n\nOur employees are our biggest assets! Come find out how we engage, with the biggest brands in the world. We look for people who collaborate, who are inspirational, who have a passion that can make a difference by working as a team while striving for global excellence.\n\nResponsibilities\n\n Our Stack \n\nFront End: Vue.js, Vuetify, Javascript\n\nBack End: Node.js, Sails.js\n\nData Store: MySQL / Amazon Aurora\n\nCloud: Amazon Web Services (AWS)\n\nYour Key Responsibilities\n Craft software designs to implement new features  Convert high-level business requirements to development tasks on JIRA.  Design & build integrations and APIs with third-party applications.  Write clean, concise, well-tested code  Troubleshoot issues reported from production and resolve them.  Code review other team member’s work, ensure that coding complies with the coding standards, and suggest improvements. \nQualifications\n Solid technical experience with the following technologies:  Web Technologies:  JavaScript / Node.js  HTML5 / CSS3  Vue.js, Vuetify  REST API  Databases:  MySQL or similar  Frameworks:  MVC  Sails.js for Node.js development  Microservices architecture  Bonus Skills:  PHP  Security Best Practices  AWS technologies and familiarity with DevOps model  2-5 Years of software development experience, in a web development environment  Love for learning new things and teaching others about them  Bachelor’s degree in Computer Science  Payments / eCommerce industry experience is a plus.  Self-starter",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Anthology Inc",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nSoftware Engineer\n\nChennai, India\n\nThe Opportunity\n\nAnthology offers the largest EdTech ecosystem on a global scale, supporting over 150 million users in 80 countries. Our mission is to provide dynamic, data-informed experiences to the global education community so that learners and educators can achieve their goals.\n\nWe believe in the power of a truly diverse and inclusive workforce. As we expand globally, we are committed to making diversity, inclusion, and belonging a foundational part of not only our hiring practices but who we are as a company.\n\nFor more information about Anthology and our career opportunities, please visit www.anthology.com .\n\nIn this role, you will join a motivated, creative, and energetic team that works in a flexible and agile fashion to deliver world-class products to the education market. By joining this team, you will become a core contributing member to Anthology’s EdTech Platform initiative. This future state platform will seamlessly and uniquely deliver a revolutionized learning experience through innovation, continuous delivery, and architectural integration.\n\nAs a Software Engineer, you will work in a SAFe Agile environment to deliver and build the next-generation EdTech platform. You will be developing and maintaining microservices that provide the foundation for teaching and learning core capabilities and features. A successful candidate must be comfortable with complex software development projects and be an innovative thinker capable of communicating multi-faceted technical concepts. As a direct contributor, the candidate must have a track record of achieving goals and meeting deadlines on multi-team projects, and the ability to work in an aggressive, fast-paced environment with evolving requirements. In addition to developing software, the ideal candidate can troubleshoot problems and support our production environments.\n\nWe are looking for a candidate with strong backend skills, with the willingness to expand and grow their skillset. This engineer will be working in a serverless environment on the AWS platform and should have a strong desire to learn as technologies evolve.\n\nThe Candidate\n\nRequired skills/qualifications:\n At least 3 years of experience in product development  Passion for software development (Python, Node.js)  Experience implementing Web Services (REST API) using Domain Driven Design and service-oriented architecture  Experience building in large-scale, AWS environments  Experience with AWS serverless: Lambda, DynamoDB, Event Bridge, ECS Fargate , etc.  Experience with git (GitHub), test driven development and CI/CD lifecycles  Ability to communicate effectively with technical and non-technical audiences in a global environment \n\nPreferred Skills/qualifications\n\n Experience with infrastructure as code, such as CDK (preferred), CloudFormation , or Terraform \n\nThe Office\n\nWe have an office in one of the biggest cultural, economic, and educational centers in South India: Chennai.\n Located on OMR, the IT corridor of South Chenna i  Easy access to Velachery, Thiruvanmiyur Railway station and bus stop  Very close to Tidel Park, and SRP Tools – Holiday Inn  Office provides lunch and snacks on all working days  Office is situated in 6th floor of Ascendas Phase 2 ( Crest Building)  Fun Committee, Happy Fete Team, Food Committee, and Sports Committee ensures fun at work  ISR Team actively engages employees in contributing to various local charities \n\nThis job description is not designed to contain a comprehensive listing of activities, duties, or responsibilities that are required. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities at any time.\n\nAnthology is an equal employment opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, gender identity/expression, protected military/veteran status, or any other legally protected factor.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Anthology Inc",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nSoftware Engineer\n\nChennai, India\n\nThe Opportunity\n\nAnthology offers the largest EdTech ecosystem on a global scale, supporting over 150 million users in 80 countries. Our mission is to provide dynamic, data-informed experiences to the global education community so that learners and educators can achieve their goals.\n\nWe believe in the power of a truly diverse and inclusive workforce. As we expand globally, we are committed to making diversity, inclusion, and belonging a foundational part of not only our hiring practices but who we are as a company.\n\nFor more information about Anthology and our career opportunities, please visit www.anthology.com .\n\nIn this role, you will join a motivated, creative, and energetic team that works in a flexible and agile fashion to deliver world-class products to the education market. By joining this team, you will become a core contributing member to Anthology’s EdTech Platform initiative. This future state platform will seamlessly and uniquely deliver a revolutionized learning experience through innovation, continuous delivery, and architectural integration.\n\nAs a Software Engineer, you will work in a SAFe Agile environment to deliver and build the next-generation EdTech platform. You will be developing and maintaining microservices that provide the foundation for teaching and learning core capabilities and features. A successful candidate must be comfortable with complex software development projects and be an innovative thinker capable of communicating multi-faceted technical concepts. As a direct contributor, the candidate must have a track record of achieving goals and meeting deadlines on multi-team projects, and the ability to work in an aggressive, fast-paced environment with evolving requirements. In addition to developing software, the ideal candidate can troubleshoot problems and support our production environments.\n\nWe are looking for a candidate with strong backend skills, with the willingness to expand and grow their skillset. This engineer will be working in a serverless environment on the AWS platform and should have a strong desire to learn as technologies evolve.\n\nThe Candidate\n\nRequired skills/qualifications:\n At least 3 years of experience in product development  Passion for software development (Python, Node.js)  Experience implementing Web Services (REST API) using Domain Driven Design and service-oriented architecture  Experience building in large-scale, AWS environments  Experience with AWS serverless: Lambda, DynamoDB, Event Bridge, ECS Fargate , etc.  Experience with git (GitHub), test driven development and CI/CD lifecycles  Ability to communicate effectively with technical and non-technical audiences in a global environment \n\nPreferred Skills/qualifications\n\n Experience with infrastructure as code, such as CDK (preferred), CloudFormation , or Terraform \n\nThe Office\n\nWe have an office in one of the biggest cultural, economic, and educational centers in South India: Chennai.\n Located on OMR, the IT corridor of South Chenna i  Easy access to Velachery, Thiruvanmiyur Railway station and bus stop  Very close to Tidel Park, and SRP Tools – Holiday Inn  Office provides lunch and snacks on all working days  Office is situated in 6th floor of Ascendas Phase 2 ( Crest Building)  Fun Committee, Happy Fete Team, Food Committee, and Sports Committee ensures fun at work  ISR Team actively engages employees in contributing to various local charities \n\nThis job description is not designed to contain a comprehensive listing of activities, duties, or responsibilities that are required. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities at any time.\n\nAnthology is an equal employment opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, gender identity/expression, protected military/veteran status, or any other legally protected factor.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "HARMAN International",
    "location": "Bengaluru, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  Will be responsible to implementing the platform software for frameworkWill have to contribute to design and ArchitectureWill be responsible to do customer requirement analysisWill have to help ram up new recruits on technical frontWill be responsible to independently own and execute core framework modulesShould be enthusiastic to learn new technologies also. Should have an innovative mindset towards problems. \nResponsibilities:\nContribute to architecture, design and reviews. Independently execute module ownership. Design, Develop and maintain framework solutions. Develop & Integrate System software with middleware and applications. \nDevelop high-quality and production ready software\nRequirements: \nFollowing experience and knowledge is needed:\nB-Tech/BE, 3-6 years experience in embedded software. 3+ years of experience in Automotive and IVI systems. Expertise in C++98,C++1,C++141 fluent in concepts of Design Patterns. Expertise in concepts like OOPS, MultithreadingExpertise in Linux system programming, Android FrameworkGood Knowledge of IPC and RPC mechanisms available in LinuxExposure to code generators would be an added advantageShould have excellent debugging skills using GDB etcShould have exposure to UML\\SysML, should be able to understand UML\\SysML diagrams and contribute to UML\\SysML based designs. Experience with Linux is a Must. Exposure to QNX, Integrity and Android will be added advantage. Exposure to internet protocols like TCP, UDPExperience with Camera/display will be good to have. Should be able to drive the design and architecture discussionsExcellent communication and negotiation skillsShould be able to work independently, contribute to requirements reviews, analysis of customer change requests\nShould have fair exposure into analyzing and debugging existing software or designing and building new ones.\nDesired Characteristics:\nKey competencies\nCritical thinking and Collaborative problem-solving skillsPlanning and organizingGood communication (verbal and written) and interpersonal skillsAdaptabilityProven coding skills",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Protegrity",
    "location": "Mumbai, Maharashtra, India, Remote",
    "description": "About the job\n        \n\n\n        \n                  The global data privacy software market is projected to grow from $2.36 billion in 2022 to $25.85 billion by 2029.\nSo, if you are searching for an innovative career, then the cybersecurity industry might just be the one for you. Protegrity, an international provider of data protection solutions, is looking for new team members who want to make an impact in a company that prioritizes something we all care about: our privacy.\nWe need people who recognize the opportunity, can plan effectively, take action and execute in the enterprise marketplace with our intuitive, diverse, and future-forward global teams.\nSo, are you up for collaborating with the best in data security?\nJoin us on this journey and make an impact with one of the top 25 global software providers. We look forward to making our world become a better place with you on our team.\nApply and discover what’s next today!\nAs a software engineer with Protegrity’s talented product development team you will contribute to cutting-edge research, development and feature design/implementation in a fast-paced Agile environment. This position is perfect for smart technical individuals who enjoy building technology, working in a team of talented engineers and being part of end-to-end product delivery life cycle.\nTo qualify, you should have 3-5 years of relevant experience in developing & integrating scalable solutions. You should be highly versatile with full stack application programming and software application design concepts and aware with the latest trends in technology.\nResponsibilities may include but not be limited to\n Contribute to continuous development, enhancement and maintenance of existing and new products/features Contribute to appropriate software development methods, standards, tools to achieve well engineered outcome. Ability to work independently by applying development practices used by the team/organization including usage of design patterns, frameworks, programming/debugging environments, IDEs etc. Participating in Agile practices of the team/organization as an individual contributor and a team player. Adaptability to learn and enhance skills in the domain of data security alongside the product’s technical environment (like OS, cloud technology, container orchestration, native programming language of the environment, hardware etc.) Ability to review work of peer engineers/juniors alongside being an individual contributor. Excellent collaboration abilities within and across teams for technical requirements and product module dependencies. Ability to be a good team player and soft skilled person.\nIn addition to the qualifications a successful candidate will demonstrate\n 3+ years post-bachelor’s degree experience as software engineer in developing & integrating big data and/or cloud solutions. Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform/Big Query/Synapse etc. Any or multiple is desirable. Knowledge of large-scale SQL engines like Hive, Presto, SparkSQL etc. Experience on any or multiple of programming languages like Java/Python/Go/C++ Knowledge of Public Cloud technologies like AWS/GCP/Azure Understanding of containerized platforms like Kubernetes or Openshift Specifying, Designing, implementing and debugging high-performance Big Data and Cloud systems Experience on Linux OS and Shell Scripting Capability to specify, design, implement, debug and profile high-performance web application software. Should be strong at debugging, troubleshooting, profiling own’s code as well as reviewing that of peers. Sufficient knowledge of office productivity tools to represent formal exchange of technical content communication. Excellent verbal and written communication skills along with good rapport and collaboration with teammates within the team.\nGood to have skills -\n Knowledge of operating systems and concepts. Linux & Windows is the preference. Knowledge of creating and operating any multi node cluster like Hadoop. Knowledge of creating and operating any containerized platform like Kubernetes in cloud Knowledge of software performance measurements and tuning Understanding of software security requirements and associated standards like NIST, OWASP, PCI-DSS etc. Has gone through a devops cycle, CI/CD pipelines and software test automations. Knowledge of cryptography and cryptographic algorithms Knowhows of Agile process for product delivery.\nPreferred Qualifications\n Background to computer science and systems Experience on Java & Python programming language Knowledge of Public Cloud technologies like AWS/GCP/Azure Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform(CDP)/Big Query/Synapse etc. Any or multiple is desirable.\nWe offer a competitive salary and comprehensive benefits with generous vacation and holiday time off. All employees are also provided access to ongoing learning & development.\nEnsuring a diverse and inclusive workplace is our priority. We are committed to an environment of acceptance where you are free to bring your full self to work. All qualified applicants and current employees will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "FIS",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Position Type\n\nFull time\n\nType Of Hire\n\nExperienced (relevant combo of work and education)\n\nEducation Desired\n\nBachelor of Computer Engineering\n\nTravel Percentage\n\n0%\n\nAre you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.\n\nAbout The Team\n\nThis role is a part of our Development Team. Develop core versions of software applications for sale to external clients. Identifies client purchasing requirements and technical specifications through Product Management and/or client representatives. Interacts with engineering groups to assist in design changes to equipment and/or software. Trains and communicates with clients on systems application.\n\nWhat You Bring\nShould have minimum 3+ Years of experience C, Unix, Database and the SDLC phaseStrong development skills in C DevelopmentExperience in any Database (Informix exposure is good to have)Should have a strong acumen in Data Structures, Algorithms, problem solving and Logical/Analytical SkillsThorough understanding of OOPs concepts, Design principles and implementation of different types of design patternsShould have experience in debugging\n\nWhat You Will Be Doing\nProviding technical expertise in every phase of the project lifecycle- from conceptual design to solution design, implementation, optimization and supportDrives the performance tuning, re-design and refactoring for a moduleBuild reusable code and libraries for future useOptimize application for maximum speed and scalabilityCollaborate with other team members and stakeholdersShould provide the documentation wherever required in the project (module tech doc, unit test cases, etc.)Sound understanding/experience in software development process, test driven development\n\nAdded bonus if you have\nKnowledge of FIS products and servicesKnowledge of financial services industryKnowledge of basic financial analysis principles and ratios\n\nWhat We Offer You\nAn exciting opportunity be a part of World’s Leading FinTech Product MNCTo be a part of vibrant team and to build up a career on core banking/payments domainA variety of career development tools, resources and opportunitiesTime to support charities and give back in your communityA fantastic range of benefits designed to help support your lifestyle and wellbeingA broad range of professional education and personal development opportunitiesA work environment built on collaboration, flexibility and respect\n\nPrivacy Statement\n\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice .\n\nSourcing Model\n\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n\n#pridepass",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Emerson",
    "location": "Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nExperience and Skillset\n Minimum of 2 years in AngularJS  Proven experience as a core developer/programmer in a team of size 2-5.  Proficient in Angular, JavaScript (ES6), HTML5 and CSS3.  Knowledge of multiple back-end languages: Java-Spring Boot, C# (.net core) & JavaScript frameworks (Node.js)  Understanding and knowledge of programming fundamentals - Clean Code concepts, Object Oriented Design, unit testing etc.  Experience developing RESTful web services (creation, consumption, integration).  Proficient in at least one database technology like MS SQL, MySQL, PostgreSQL, or MongoDB.  Knowledge of Git version control, DevOps is a plus  Experience as a Developer in Agile projects.  Ability to code for multiple projects at a time  Ability to understand the business requirements, system architecture and process guidelines  Ability to tackle ambitious problems and work independently as well as part of a team.  Ability to handle end to end projects on individual basis  Knowledge of web and mobile UX/UI technologies and architectures.  Experience developing front-end client applications using the latest techniques such as Angular.js/JavaScript/HTML5/CSS3 front-end code across both web and mobile projects.  Understand when mobile web apps are appropriate, as opposed to native applications.  Responsibilities\n Coding, unit testing and fixing bugs or other coding issues.  Ability to code for complex requirements under tight timelines  Ability to work with cross functional / domain teams  Work in a fast-paced and agile development environment  Work with development teams and Solutions Architect to ideate software solutions.  Building front-ends for coded applications through using visual designs.  Develop and manage well-functioning databases and applications.  Write effective APIs.  Unit test to ensure responsiveness and efficiency.  Troubleshoot, debug and upgrade software.  Build features and applications with a mobile responsive design  Write technical documentation.  Work with data scientists and analysts to improve software.",
    "link": "https://www.linkedin.com/jobs/view/3509269955/?eBP=CwEAAAGHHHfd4EnaKTOci-XPXRfC_vObBgjQG4wlRAwvSxGfeCaIi2g_NLHgGtLvpjOtzstkwwQ-dtDqp0JckJniaCIq-AxnyDigkLtH92xjcuhbHdZGc47IzvxmD1w04Q70izZScE6e_0pChfZThJzvToZainQOx0YNr4iv0DrX4QxJ1R-urrhw7djKtzlt8Ijn0OftU67ZSiwLaZGGN0Vy8cJJ5BrffFOU2h3xFbyWzwh4ZKsXAPHQ0F6S_BLw9o1PWPiEslxHEZvMZSWYSLe6MIZCGyJs-nWKNBPLBK7BCCqOIqc5KVyZIHS-bMCRm6_vDrU3mOBu3LhbSXdEpq6LYWB1DmZC7bURSsDR8AQVo99nu8Ddm43Wn7RO&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=kcxTBLPoeJLfjgwp7IJV4Q%3D%3D&trackingId=cMbLvb03PgNV40QSDYZCxQ%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  }
]