[
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Securin Inc.",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Requirements for Java DeveloperAt least 5-8 years of work experience as a Java Developer or any similar role.Experience with Object-Oriented Design. And In-depth knowledge of popular frameworks like Spring Boot, JPA, Spring Batch etc.,Familiar with SQL or Search like MySQL, and Elastic SearchExperience with large and disparate data set.Creating Web Services and RESTful services with Web API.Familiar with Open Source tools and good to have experience with Amazon Web Service (AWS).Familiar with Caching Solution like RedisGood to have Containerization skills and working with CI CD pipeline\nResponsibilities \nImplementing modernized application design and testing features before release.Hands-on experience in developing software with agile or scrum methodologies.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Developer",
    "companyName": "Wipro",
    "location": "Mumbai, Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Role Purpose\n\nThe purpose of this role is to design, test and maintain softwareprograms for operating systems or applications which needs to bedeployed at a client end and ensure its meet 100% quality assuranceparameters\n\nDoInstrumental in understanding the requirements and design ofthe product/ softwareDevelop software solutions by studying information needs,studying systems flow, data usage and work processesInvestigating problem areas followed by the software developmentlife cycleFacilitate root cause analysis of the system issues and problemstatementIdentify ideas to improve system performance and impactavailabilityAnalyze client requirements and convert requirements to feasibledesignCollaborate with functional teams or systems analysts who carryout the detailed investigation into software requirementsConferring with project managers to obtain information onsoftware capabilitiesPerform coding and ensure optimal software/ moduledevelopment Determine operational feasibility by evaluating analysis,problem definition, requirements, software development and proposedsoftwareDevelop and automate processes for software validation by setting up and designing test cases/scenarios/usage cases, andexecuting these casesModifying software to fix errors, adapt it to new hardware,improve its performance, or upgrade interfaces.Analyzing information to recommend and plan the installation ofnew systems or modifications of an existing systemEnsuring that code is error free or has no bugs and test failurePreparing reports on programming project specifications,activities and statusEnsure all the codes are raised as per the norm defined forproject / program / account with clear description and replicationpatternsCompile timely, comprehensive and accurate documentation andreports as requestedCoordinating with the team on daily project status and progressand documenting itProviding feedback on usability and serviceability, trace theresult to quality risk and report it to concerned stakeholdersStatus Reporting and Customer Focus on an ongoing basis withrespect to project and its executionCapturing all the requirements and clarifications from theclient for better quality workTaking feedback on the regular basis to ensure smooth and ontime deliveryParticipating in continuing education and training to remaincurrent on best practices, learn new programming languages, and betterassist other team members.Consulting with engineering staff to evaluate software-hardwareinterfaces and develop specifications and performance requirementsDocument and demonstrate solutions by developing documentation,flowcharts, layouts, diagrams, charts, code comments and clear codeDocumenting very necessary details and reports in a formal wayfor proper understanding of software from client proposal toimplementation Ensure good quality of interaction with customer w.r.t. e-mailcontent, fault report tracking, voice calls, business etiquette etcTimely Response to customer requests and no instances ofcomplaints either internally or externally\n\nStakeholder Interaction\n\nStakeholder Type\n\nStakeholder Identification\n\nPurpose of Interaction\n\nInternal\n\nLead Software Developer and Project Manager\n\nRegular reporting & updates\n\nSoftware Developers \n\nFor work coordination and support in providing testing solutions\n\nExternal\n\nClients\n\nProvide apt solutions and support as per the requirement\n\n \n\n \n\nDisplay\n\nLists the competencies required to perform this role effectively:Functional Competencies/ SkillLeveraging Technology – Knowledge of current and upcomingtechnology along with expertise in programming (automation, tools andsystems) to build efficiencies and effectiveness in own function/ Clientorganization – CompetentProcess Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk – ExpertTechnical knowledge – knowledge of various programminglanguages, tools, quality management standards and processes - Expert\n\nCompetency Levels\n\nFoundation\n\nKnowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance.\n\nCompetent\n\nConsistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well.\n\nExpert\n\nApplies the competency in all situations and is serves as a guideto others as well.\n\nMaster\n\nCoaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognised within the entire organization.\n\n \n\n Behavioral CompetenciesFormulation & PrioritizationInnovationManaging ComplexityExecution ExcellencePassion for Results\n\nDeliver\n\nNo.\n\nPerformance Parameter\n\nMeasure\n\nContinuous Integration, Deployment & Monitoring of Software\n\n100% error free on boarding & implementation, throughput %,Adherence to the schedule/ release plan\n\nQuality & CSAT\n\nOn-Time Delivery, Manage software, Troubleshoot queries\n\nCustomer experience, completion of assigned certifications for skillupgradation\n\nMIS & Reporting\n\n100% on time MIS & report generation\n\nSAP BW HANA",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Incedo Inc.",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Role Description: Java Developer\n\nWe are looking for a candidate able to lead & own the development & integration of product/service lines. Understands the technical requirements; develops the technology project plan and communicates the schedule to the team. Liaison with technical & domain architects to facilitate selection of appropriate technologies to meet the customer requirements\n\nRole and responsibilities:\n\n• Participate in the full development life cycle, working within broadly defined parameters.• Own the delivery of an entire piece of a system or application.• Management and execution against project plans and delivery commitments.• Work closely with development manager, tech leads, Scrum master and Product owner to develop the best technical design and approach for new product development.• Create and execute appropriate quality plans, project plans, test strategies and processes for development activities in concert with business and project management efforts• Writing high quality code, participating in code reviews, designing/architecting systems of varying complexity and scope, and creating high quality documentation supporting the design/coding tasks\n\nTechnical skills requirements:\n\nThe candidate must demonstrate proficiency in,• Strong java developer with 3+(3-5) years of experience.• Good in core java 8 or above.• SpringBoot, Hibernate, Good Database skills.• Experience in Microservices architecture.• Experience using any messaging framework\n\nRegards,Incedo HR Team",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Developer",
    "companyName": "Weatherford",
    "location": "Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Responsibilities\nMinimum 2-5+ years related experience - Must have Engineering Degree\nRequired:Minimum 2-5 years of programming experienceE/B.Tech/B.S degree in Computer Science or related Engineering discipline.\nPreferred:E/M.Tech/MS with 2+ years of software development experience.\nQualifications\nThis is the intermediate level job. Performs routine tasks associated with the design, modification, development, writing and implementing software programming applications. Applies standard techniques, procedures and criteria to support and/or install software applications/operating systems. Work is overseen by leader to ensure that tasks are completed in a timely manner. Has knowledge of commonly-used concepts, practices, and procedures. Participates in the testing process through test review and analysis, test witnessing and certification of software. Resolves routine questions or problems, referring only complex issues to a higher level. All work performed is thoroughly reviewed for application of sound professional judgment.\nDevelop and maintain engineering software for use in the upstream oil and gas industry.Contribute to the creation of system and product architecture, design, and interface definitions.Participate in change control decisions of products.Perform requirements analysis and decomposition to assist with defining product requirements and product conceptualization.Identify and assist in the management of intellectual property, third-party software, re-use, and compliance.Provide technical help to the organization and development team.Act as a junior level technical consultant to Product Line Management, Support, Deployment, and Testing organizations, as well as to other development teams.Contribute significantly to product roadmaps, estimation, planning, identification of risks and issues, and development status.Demonstrate good interpersonal and communication skills with the ability to work closely with internal and external customers to translate needs into requirements, to explain and resolve technical issues, and to present technical solutions.Support in defining strategies, guidelines, and goals for integration of components, product testing, and acceptance testing.Responsible for providing technical oversight for the successful implementation and test of product features.Resolve complex product and system issues.Actively engage in process improvements and execution of established processes.Coach and mentor peers and junior engineers.Analyze requirements and architecture to perform design and implementation of software applications.Support the creation of documentation and training material.Understand and comply with all safety rules and company policies.Perform various other duties and activities as assigned by supervisor within the physical constraints of the job.\nCompany Overview\nWeatherford is a leading global energy services company. Our world-class experts partner with customers to optimize their resources and realize the full potential of their assets. Across our operating locations, including manufacturing, research and development, service, and training facilities, operators choose us for strategic solutions that add efficiency, flexibility, and responsibility to any energy operation.\nWe are focused on technology development, digital solutions, and defining our footprint in the new energy space. Our ability to provide integrated solutions across our segments will be critical to growth in our core operations and the energy transition.\nEnergy producers face unique challenges every day, so it is our job to create solutions that enhance safety, streamline operations, and sustain uptime to meet or exceed their targets. We operate across the global energy landscape employing some of the best diverse talent in the industry. At Weatherford, we understand the value each individual brings to the table. We celebrate diversity in all its forms and are immensely proud of our workforce. We invite you to join our passionate, talented, word-class team.\nWhen you join Weatherford, you instantly feel connected to something bigger – a community that is grounded by our core values and driven to create innovative solutions for our customers. We celebrate each other’s successes, grow together, and learn from each other constantly. Individually, we are impressive. Together, we are unstoppable. We are One Weatherford.\nWeatherford offers competitive compensation, a comprehensive benefits program and provides you a challenging and enriching career path, with a healthy balance of structure and flexibility to chart your own course.\nWeatherford is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Socure",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Predictive analytics and machine learning power Socure’s groundbreaking technology and fuel our mission to verify 100% of good identities in real time and completely eliminate identity fraud on the internet.\nSocure is the world leader in digital identity verification and fraud prevention. Our recent awards include Forbes 2022 America’s Best Startup Employers, The Forbes Cloud 100, The Deloitte Technology Fast 500, and Inc. 5000’s fastest growing companies.\nListen to why some of the world’s top technology investors see the enormous, transformative potential in Socure’s mission and products:\nhttps://www.youtube.com/watch?v=ifM9_jPQCv8\nWhat the Role Is: \nWe are hiring passionate Software Engineers in Chennai!\nWhat You'll Do:\nPartner with our globally distributed cross-functional teams (Product, Infrastructure, Engineering, Data Science) to conceptualise and develop new features and products in an Agile environmentOwn end-to-end delivery of software components all the way to production, including team features or systemsBuild web services and REST APIs at scale, and produce high-quality results with direct business impactMonitor and improve existing deployments, ensuring that we are continuously improving our productAssist our QA and support team in triaging and resolving production issues and addressing bugs\nWhat You'll Bring:\n5-7 years of relevant experienceInterest in our tech stack (Java or Scala, SQL Databases, NoSQL, Microservices, and AWS)Strong computer science fundamentals with data structures, algorithms, various programming languages, distributed systems, etc. Understanding of engineering best practices—you constantly seek to improve engineering standards, tooling and processesAbility to write “good code” - easily understandable, secure and testable! Comfortable helping drive technical decisions within our Engineering teamExperience building applications at scale\nSocure is all about encouraging people to push the boundaries of what’s possible through top-tier performance, innovation, ownership, and shared expertise.\nWe empower excellence by providing great perks and benefits to both our fully remote employees in North America and our hybrid teams in India.\nTo learn more, check out Socure’s Career Page: https://www.socure.com/company/careers\nSocure is an equal opportunity employer and value diversity of all kinds at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nTo learn more about how our work is changing the world, check out these articles and videos:\nSocure is Forbes' 2022 Best Startup Employer: bit.ly/3fbNw8SSocure Accelerates Onboarding for 50+ Crypto, Neobanks, and More: https://bit.ly/3dwN2K7Socure's Impact on Financial Inclusion: https://www.youtube.com/watch?v=Y6nBc6s1wsUSocure's Impact on Fraud Prevention: https://www.youtube.com/watch?v=M46UG8QyKe4Archives & Press Releases: https://learn.socure.com/about/press-release",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "Esko",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description – Software Engineer II\nPosition\nSoftware Engineer II\nWe are looking for an enthusiastic and motivated Software Engineer to join our new product development team. You will be a core member central to our engineering team where-in your daily work will allow you to work on developing applications for our AppStore; and to bring a more global technical knowledge to everything you touch; and thereby enable build solid specialties.\nRole / Job Objective:\nThe Engineer will be responsible for designing, developing, reviewing and maintaining software, and overall system architecture, as well as providing technical feedback and sharing knowledge.\nResponsibilities and Key Activities:\nBreak down high-level objectives into specific software development tasks and follow through on their executionHigh level understating and reviewing of epics and user stories. Breaking down of user stories to development tasks and estimating those storiesCreate feasibility analysis and provide accurate effort estimates. Ownership to develop plan and deliver to meet schedule and quality expectation of product ownerWrite code that is easy to understand and fits with existing patternsConduct peer code reviews and perform unit and integration testingImplement unit testing, documentation of API, integration testing, deployment approach, and maintain programming documentation which include commenting code and user guidesAnalyze, debug and solve complex technical issues and customer escalationsProvide status updates, and produce high quality deliverables in a timely mannerCommunicate and interact effectively with team members, product owner, QA, supports, and other departments within EskoStay current on software technology, concepts and tools, as well as related and competing products\nQualifications and Professional knowledge:\nEngineering degree in Computer Science or equivalent4 to 6 years of work experience with at least 3 years in Web Development 3+ years of hands on experience in developing applications with HTML5, CSS, Bootstrap, advanced JavaScript libraries and frameworksMust be familiar with Web Application Architecture, Typescript and Node.jsMust be familiar with Cloud concepts especially in AWS - EC2, Lambda and other related conceptsGood knowledge of object oriented (OOPS) concepts and design patterns Proficiency with agile software development tools like JIRA, GitHub, etc.Good analytical skills and self-initiative to learn new technologiesFlexibility and willingness to work in different stacks of technology is desirable. Being technology agnostic is an added plus\nDesired characteristics:\nA technical mindset with great attention to detailFlexible, willing to “go the extra mile” while at the same time being an agile and fast learnerResult oriented with strong self-management skillsExperience and desire to work in a global delivery environmentAble to stay calm, friendly, a team player, and able to demonstrate good composure when handling complicated problemsVery good sense of ownershipGood analytical skills and self-initiative to learn new methodologies and techniquesEffective and Clear Communicator, asking right questions, actively listen and ability to collect right inputs\nReporting and Ownership\nReports to Team Leader\nWhen you join us, you’ll also be joining Danaher’s global organization, where 80,000 people wake up every day determined to help our customers win. As an associate, you’ll try new things, work hard, and advance your skills with guidance from dedicated leaders, all with the support of powerful Danaher Business System tools and the stability of a tested organization.\nAt Danaher, we value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve. Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.\nIf you’ve ever wondered what’s within you, there’s no better time to find out.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Anthology Inc",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nSoftware Engineer\n\nChennai, India\n\nThe Opportunity\n\nAnthology offers the largest EdTech ecosystem on a global scale, supporting over 150 million users in 80 countries. Our mission is to provide dynamic, data-informed experiences to the global education community so that learners and educators can achieve their goals.\n\nWe believe in the power of a truly diverse and inclusive workforce. As we expand globally, we are committed to making diversity, inclusion, and belonging a foundational part of not only our hiring practices but who we are as a company.\n\nFor more information about Anthology and our career opportunities, please visit www.anthology.com .\n\nIn this role, you will join a motivated, creative, and energetic team that works in a flexible and agile fashion to deliver world-class products to the education market. By joining this team, you will become a core contributing member to Anthology’s EdTech Platform initiative. This future state platform will seamlessly and uniquely deliver a revolutionized learning experience through innovation, continuous delivery, and architectural integration.\n\nAs a Software Engineer, you will work in a SAFe Agile environment to deliver and build the next-generation EdTech platform. You will be developing and maintaining microservices that provide the foundation for teaching and learning core capabilities and features. A successful candidate must be comfortable with complex software development projects and be an innovative thinker capable of communicating multi-faceted technical concepts. As a direct contributor, the candidate must have a track record of achieving goals and meeting deadlines on multi-team projects, and the ability to work in an aggressive, fast-paced environment with evolving requirements. In addition to developing software, the ideal candidate can troubleshoot problems and support our production environments.\n\nWe are looking for a candidate with strong backend skills, with the willingness to expand and grow their skillset. This engineer will be working in a serverless environment on the AWS platform and should have a strong desire to learn as technologies evolve.\n\nThe Candidate\n\nRequired skills/qualifications:\n At least 3 years of experience in product development  Passion for software development (Python, Node.js)  Experience implementing Web Services (REST API) using Domain Driven Design and service-oriented architecture  Experience building in large-scale, AWS environments  Experience with AWS serverless: Lambda, DynamoDB, Event Bridge, ECS Fargate , etc.  Experience with git (GitHub), test driven development and CI/CD lifecycles  Ability to communicate effectively with technical and non-technical audiences in a global environment \n\nPreferred Skills/qualifications\n\n Experience with infrastructure as code, such as CDK (preferred), CloudFormation , or Terraform \n\nThe Office\n\nWe have an office in one of the biggest cultural, economic, and educational centers in South India: Chennai.\n Located on OMR, the IT corridor of South Chenna i  Easy access to Velachery, Thiruvanmiyur Railway station and bus stop  Very close to Tidel Park, and SRP Tools – Holiday Inn  Office provides lunch and snacks on all working days  Office is situated in 6th floor of Ascendas Phase 2 ( Crest Building)  Fun Committee, Happy Fete Team, Food Committee, and Sports Committee ensures fun at work  ISR Team actively engages employees in contributing to various local charities \n\nThis job description is not designed to contain a comprehensive listing of activities, duties, or responsibilities that are required. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities at any time.\n\nAnthology is an equal employment opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, gender identity/expression, protected military/veteran status, or any other legally protected factor.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Developer",
    "companyName": "Wipro",
    "location": "Mumbai, Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Role Purpose\n\nThe purpose of this role is to design, test and maintain softwareprograms for operating systems or applications which needs to bedeployed at a client end and ensure its meet 100% quality assuranceparameters\n\nDoInstrumental in understanding the requirements and design ofthe product/ softwareDevelop software solutions by studying information needs,studying systems flow, data usage and work processesInvestigating problem areas followed by the software developmentlife cycleFacilitate root cause analysis of the system issues and problemstatementIdentify ideas to improve system performance and impactavailabilityAnalyze client requirements and convert requirements to feasibledesignCollaborate with functional teams or systems analysts who carryout the detailed investigation into software requirementsConferring with project managers to obtain information onsoftware capabilitiesPerform coding and ensure optimal software/ moduledevelopment Determine operational feasibility by evaluating analysis,problem definition, requirements, software development and proposedsoftwareDevelop and automate processes for software validation by setting up and designing test cases/scenarios/usage cases, andexecuting these casesModifying software to fix errors, adapt it to new hardware,improve its performance, or upgrade interfaces.Analyzing information to recommend and plan the installation ofnew systems or modifications of an existing systemEnsuring that code is error free or has no bugs and test failurePreparing reports on programming project specifications,activities and statusEnsure all the codes are raised as per the norm defined forproject / program / account with clear description and replicationpatternsCompile timely, comprehensive and accurate documentation andreports as requestedCoordinating with the team on daily project status and progressand documenting itProviding feedback on usability and serviceability, trace theresult to quality risk and report it to concerned stakeholdersStatus Reporting and Customer Focus on an ongoing basis withrespect to project and its executionCapturing all the requirements and clarifications from theclient for better quality workTaking feedback on the regular basis to ensure smooth and ontime deliveryParticipating in continuing education and training to remaincurrent on best practices, learn new programming languages, and betterassist other team members.Consulting with engineering staff to evaluate software-hardwareinterfaces and develop specifications and performance requirementsDocument and demonstrate solutions by developing documentation,flowcharts, layouts, diagrams, charts, code comments and clear codeDocumenting very necessary details and reports in a formal wayfor proper understanding of software from client proposal toimplementation Ensure good quality of interaction with customer w.r.t. e-mailcontent, fault report tracking, voice calls, business etiquette etcTimely Response to customer requests and no instances ofcomplaints either internally or externally\n\nStakeholder Interaction\n\nStakeholder Type\n\nStakeholder Identification\n\nPurpose of Interaction\n\nInternal\n\nLead Software Developer and Project Manager\n\nRegular reporting & updates\n\nSoftware Developers \n\nFor work coordination and support in providing testing solutions\n\nExternal\n\nClients\n\nProvide apt solutions and support as per the requirement\n\n \n\n \n\nDisplay\n\nLists the competencies required to perform this role effectively:Functional Competencies/ SkillLeveraging Technology – Knowledge of current and upcomingtechnology along with expertise in programming (automation, tools andsystems) to build efficiencies and effectiveness in own function/ Clientorganization – CompetentProcess Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk – ExpertTechnical knowledge – knowledge of various programminglanguages, tools, quality management standards and processes - Expert\n\nCompetency Levels\n\nFoundation\n\nKnowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance.\n\nCompetent\n\nConsistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well.\n\nExpert\n\nApplies the competency in all situations and is serves as a guideto others as well.\n\nMaster\n\nCoaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognised within the entire organization.\n\n \n\n Behavioral CompetenciesFormulation & PrioritizationInnovationManaging ComplexityExecution ExcellencePassion for Results\n\nDeliver\n\nNo.\n\nPerformance Parameter\n\nMeasure\n\nContinuous Integration, Deployment & Monitoring of Software\n\n100% error free on boarding & implementation, throughput %,Adherence to the schedule/ release plan\n\nQuality & CSAT\n\nOn-Time Delivery, Manage software, Troubleshoot queries\n\nCustomer experience, completion of assigned certifications for skillupgradation\n\nMIS & Reporting\n\n100% on time MIS & report generation\n\nNET",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "NatWest Group",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Our people work differently depending on their jobs and needs. From hybrid working to flexible hours , we have plenty of options that help our people to thrive.\nThis role is based in India and as such all normal working days must be carried out in India.\nJoin us as a Software Engineer\n\nIn your new role, you’ll engineer and maintain innovative, customer-centric, high-performance, secure and robust solutionsWe’ll look to you to design and engineer software focusing on the customer or user experience as the primary objectiveIt’s a chance to hone your existing technical skills and advance your career as you develop the discipline of software engineering across our business\n\nWhat you'll do\nAs a Software Engineer, you’ll design, develop and deploy applications capable of meeting and exceeding the anticipated load, performance and availability volumes, including load balancing, performance testing and benchmarking.\nYou’ll be working within a feature team and using your extensive experience to engineer software, scripts and tools that're often complex, as well as liaising with other engineers, architects and business analysts across the platform.\nYou’ll also be:\n\nProducing high-quality software which adds value to our businessWorking in permanent teams on the full lifecycle, from initial development, through enhancement and maintenance to replacement or decommissioningCollaborating to optimise our software engineering capabilitiesDesigning, producing, testing and implementing our working codeWorking across the lifecycle, from requirements analysis and design, through coding to testing, deployment and operations\n\nThe skills you'll need\nYou’ll need a background in software engineering, software design, architecture, and an understanding of how your area of expertise supports our customers. We'll also need you to be proficient in IBM Watson conversation development.\nAs well as this, you’ll have experience of test-driven development, alongside the use of automated test frameworks, mocking or stubbing and unit testing tools. Ideally, you’ll also have a background in solving highly-complex, analytical and numerical problems.\nFurthermore, you’ll need:\n\nExperience of working with code repositories, bug tracking tools and wikis, as well as experience of designing and implementing APIsCoding experience in multiple programming languagesExperience of DevOps and Agile methodology and associated toolsets and methodologiesKnowledge of relational, in-memory, distributed and NoSQL databasesAn awareness of DWS deployment commands\n\n\nApply for this job",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer - Full stack",
    "companyName": "IKEA",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  \nWe are creating a better financial every day for the modern lives of the many people, and we need your help to do it!\n\nOur team is building new products to help create better finances, financing their dreams, and making more responsible choices. We are in the early phases of establishing these products and for some, we are still validating our main hypothesis of customer value.\n\nSo, if you would like to get in on the ground floor of a fantastic journey to help our customers, this is the team to join!\n\nWhat You’ll Need To Have\n\nBeing a greenfield space, you will get to influence the technology landscape in the team. The technology considerations could include (but is not limited to), tech stack used by our sister teams such as \n• Frontend - React and Typescript with the CI pipeline in GitHub actions \n• Backend - Golang (running on GCP, using Cloud Run as compute and Cloud Spanner as primary storage)\n• Java/J2EE, NodeJS, React JS, HTML 5, CSS 3 Javascript etc.\n• Fastly Compute at Edge\n• NodeJS\n• Fastly\n• Akamai CDN / WAF\n• Optimizely Fullstack\n• Auth0\n\nWe Prefer\n\n• Formal qualifications in computer science, software engineering, or any engineering equivalent\n• Minimum 7 years of professional experience as software engineer with similar level of experience in the specific tech stack for the area\n• Minimum 3 years’ experience of working in agile/iterative software development teams with a DevOps working setup and with an emphasis on self-organization and delivery to agreed commitments\n• Experience in React and Typescript, GCP is must ; Golang (secondary preference node.js)\n• Deeply knowledgeable in cloud native development\n• Experience in building, running and operating systems that handle significant traffic volumes.\n• Has a security-by-design mindset and knowledge\n• Has a user-centered approach to software engineering\n• Knowledge of architectural design patterns\n• Experience in developing services that dynamically scale and understands upstream and downstream effects of this\n• Strong analytical skills and ability to solve complex problems at scale\n• Excellent written and verbal English communication skills\n• Anyone with prior start up experience or building new application from scratch experience (highly recommended) \n• Comfortable working through ambiguity \n \n \n “At IKEA, you’re welcome no matter where you come from, what you believe, and what you look like. We don’t even care how you have furnished your home. We’re interested in you simply because you’re you. Our different views, backgrounds, and personalities make us better understand our customers, give us more fun at work and spark more and better ideas. Perhaps your unique take on something could lead to a great idea that creates a better everyday life for the many people\n\nWe are looking for an engineer that enjoys building things that make an impact with our customers. Are you excited about technology and want a chance to be part of building better digital products for our customers? Look no further, you have arrived at the right opportunity!\n\nOur teams come from diverse backgrounds, coming together in the mission of creating a better everyday life for the many people over several touchpoints for the customers. In a true cross functional team with designers, data analysts, engineers, agile coach, and product owner we make this a reality.\n\nWe expect all team members to contribute to good software design principles and keep each other accountable for the principles decided upon in the team. We use these principles to guide the team when looking for new solutions to problems, such as bringing in new tools, frameworks or creating new solutions.\n\nYou relish the opportunity to contribute to the team’s internal metrics and the product metrics. You would be part of defining how and what we measure to define success from an engineering perspective.\n\nSpecifically, we are looking for an engineer with experience in building web applications at scale, well versed in both – frontend and backend even better!\n\nA Day In Your Life With Us\n\nAs Senior Software Engineer, your main responsibilities will include:\n• Building software that meets the team’s high standards\n• Contribute to all aspects of the product lifecycle, with a focus on engineering (including new product ideas)\n• Lead and promote good software engineering practices within an agile/iterative development approach in order to improve time to market and fulfill business needs\n• Partner closely with engineering manager. Onboard, coach and mentor engineers in order to secure transfer of competence and a high performing team\n• Design and educate other engineers in ways of working, encouraging good practices to meet consumer expectations on Product or Service delivery\n• Define solution architecture and contribute to the landscape architecture\n• Define, maintain, and improve our integration and delivery pipeline\n• Explore and apply new technologies suitable for our product\n• Take responsibility for the product, all the way from ideation to runtime, this may include on call duties \n \n TOGETHER AS A TEAM \n Studies show that members of underrepresented communities don’t apply for jobs unless they’re 100% “qualified”. If this is part of the reason you hesitate to apply, we like you to reconsider and give it a chance. Maybe your profile fits our needs much better than you think. We look forward to receiving your application.\n\nFrom: “Why Women Don’t Apply for Jobs Unless They’re 100% Qualified” by Tara Sophia Mohr, August 2014”\n\n\nWe warmly welcome your application!",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer Lead - Fullstack",
    "companyName": "CSG",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Remote, India\nHi, I'm Debin Dennis, your Recruiter. At CSG, we choose to see beyond a resume paper. We put your story, perspective, background, and what you have to offer first. While the traditional approach works for some, many miss out on fantastic talent like yourself, and we refuse to make that mistake. Instead, we believe that by channeling the power of all, we make ordinary customer and employee experiences extraordinary.\nChannel the power of YOU as the next Full-Time Software Development Engineering Lead – Full Stack at CSG.\nWho will love this job\nA hybrid – you excel when you can choose your work style - remote, in-office, or a combination of bothAn analyzer – you enjoy making sense of data and making it meaningful for others to understandA thinker – you take advantage of resources and implement ideas in new ways to find solutionsAn empath – you know how to connect and communicate with different audiencesA producer – you're comfortable quickly switching context and adapting\nWhat you'll do\nYou will report to Software Development Director to contribute toward working with the Metrics and Monitoring Team to support our mission providing an end-to-end solution to update and improve the monitoring systems used by CSG's applications, servers, and hostsYou will work in a DevOps culture employing Agile development practices and monitoring space providing support for CSG's monitoring toolsExperience with object-oriented programming and design patterns, AWS, testing framework, and refactoring legacy code, writing and consuming REST APIs in C#Understand SOLID and Clean Code programming practices while implementing Agile methodologies and ceremonies, such as Kanban, SCRUM, Standup, Planning, and RetroKnowledgeable with JavaScript, Angular JS, Linux, Windows, NUnit, and SeleniumUnderstanding of containerization, Kubernetes, Swarms, ECS or similar deployment stack\nYou should have\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike majority candidates meeting fewer requirements. Channel the power of YOU and apply to discover if we're a match.\nBachelor's degree in business, related field, or equivalent experienceProficiency in English in a business environment7 years of experience with Java or NodeExperience in Angular (2+)/React, HTML5, CSS, TypeScript, SASS, LESS, REST APIs and SQLUnderstanding of Microservices and design patterns.Experience in SAAS product - optional\nPerks & Benefits\nWork from Home, in-office, or hybridPaid Vacation, Volunteer, Compassionate, and Holiday Time OffInsurance coverage for the family including in-laws, group personal accident and term life insurance policyEmployee Insurance Top-UpTele consultationSodexoEmotional and Mental Well-being SupportParental LeaveEducation and Internet reimbursement\nOur Story\nFor over 40 years, we've serviced the world's most recognizable brands with future-ready solutions in customer engagement, revenue management, and payments that make ordinary customer experiences extraordinary. As a trusted technology provider in telecommunications, retail, financial services, and healthcare, our solutions impact over 900 customers in over 120 countries. Over 5,000 customer-obsessed CSGers in more than 20 countries made it possible and helped reach our $1 billion in revenue milestone.\nOur Way of Life\nOur people power a culture of integrity, innovation, and impact. In return, we power our people with the choice to work from home, in-office, or a hybrid work combination that integrates well with their lifestyle. You'll find CSGers exercising this choice at most of our locations worldwide.\nWe are committed to building and nurturing a diverse, supportive, and inclusive work environment where individuality is valued, and our people can flourish. We believe our workforce should reflect the world we live in and that we are stronger because of our differences. By embracing different backgrounds, attributes, experiences, and perspectives, we will help our employees, customers, and communities excel while, together, we work toward making social equality a reality.\nWe are committed to making a bigger community impact by creating new opportunities and access for underrepresented communities, protecting the environment, and developing technology solutions that foster digital inclusivity. That's just who we are. If not us, then who?\nFollow us! LinkedIn | Facebook | Twitter\nLocation(s):\nIN.Bangalore.Remote",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer Senior",
    "companyName": "FIS",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Position Type\n\nFull time\n\nType Of Hire\n\nExperienced (relevant combo of work and education)\n\nEducation Desired\n\nBachelor of Computer Engineering\n\nTravel Percentage\n\n0%\n\nWhat you bring\nExperience in Web application development in Java/J2EE (JSP, Servlets, JDBC, XSLT) with any database as backend and having ability to learn and adapt quickly to new business situationsExpert knowledge of Spring’s IOC, Spring WebFlow, Spring MVC, Spring security, Spring's integration with Hibernate and Struts technologiesAble to use J2EE Application Servers such as Apache Tomcat, Glassfish, WebSphere and Jboss 7.0 deployment and managementExperience in writing and executing JUnit test cases using mocking techniques. Experience and hands-on of Selenium framework for automated test cases development Extensive exposure of Unix regression testingMinimum 1.5 years of hands-on of Java web applications production issues debugging and resolution experienceExperience with JavaScript, JQuery, XML, CSS and HTML5 is essentialExperience with Eclipse development environment is requiredExpertise in RESTful, Soap and document style webservice development is a mustWorking knowledge of SQL, XML, Putty, Unix, LinuxAnalyzes, designs, programs, debugs and modifies software enhancements and/or new products used in local, networked or Internet-related computer programs. (Code must be used in core version of applications available for sale commercially.)Interacts with product managers and/or users to define system requirements and/or necessary modificationsParticipates in software design meetings and analyzes user needs to determine technical requirementsWrite technical specifications based on conceptual design and stated business requirementsWrites code, completes programming and performs testing and debugging of applications using current programming languages and technologiesCompletes documentation and procedures for installation and maintenanceTrains and communicates with internal Client Training, Client Relationship and Sales teams on systems applicationMay be responsible for developing or executing project plans, budgets and schedules and for documenting work and resultsMay deliver informational and decision-seeking presentations to technical and business groups to internal and/or external audiences\n\nPrivacy Statement\n\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice .\n\nSourcing Model\n\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n\n#pridepass",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer Senior",
    "companyName": "FIS",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Position Type\n\nFull time\n\nType Of Hire\n\nExperienced (relevant combo of work and education)\n\nEducation Desired\n\nBachelor of Computer Engineering\n\nTravel Percentage\n\n0%\n\nWhat you bring\nExperience in Web application development in Java/J2EE (JSP, Servlets, JDBC, XSLT) with any database as backend and having ability to learn and adapt quickly to new business situationsExpert knowledge of Spring’s IOC, Spring WebFlow, Spring MVC, Spring security, Spring's integration with Hibernate and Struts technologiesAble to use J2EE Application Servers such as Apache Tomcat, Glassfish, WebSphere and Jboss 7.0 deployment and managementExperience in writing and executing JUnit test cases using mocking techniques. Experience and hands-on of Selenium framework for automated test cases development Extensive exposure of Unix regression testingMinimum 1.5 years of hands-on of Java web applications production issues debugging and resolution experienceExperience with JavaScript, JQuery, XML, CSS and HTML5 is essentialExperience with Eclipse development environment is requiredExpertise in RESTful, Soap and document style webservice development is a mustWorking knowledge of SQL, XML, Putty, Unix, LinuxAnalyzes, designs, programs, debugs and modifies software enhancements and/or new products used in local, networked or Internet-related computer programs. (Code must be used in core version of applications available for sale commercially.)Interacts with product managers and/or users to define system requirements and/or necessary modificationsParticipates in software design meetings and analyzes user needs to determine technical requirementsWrite technical specifications based on conceptual design and stated business requirementsWrites code, completes programming and performs testing and debugging of applications using current programming languages and technologiesCompletes documentation and procedures for installation and maintenanceTrains and communicates with internal Client Training, Client Relationship and Sales teams on systems applicationMay be responsible for developing or executing project plans, budgets and schedules and for documenting work and resultsMay deliver informational and decision-seeking presentations to technical and business groups to internal and/or external audiences\n\nPrivacy Statement\n\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice .\n\nSourcing Model\n\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n\n#pridepass",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Developer",
    "companyName": "Wipro",
    "location": "Mumbai, Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Role Purpose\n\nThe purpose of this role is to design, test and maintain softwareprograms for operating systems or applications which needs to bedeployed at a client end and ensure its meet 100% quality assuranceparameters\n\nDoInstrumental in understanding the requirements and design ofthe product/ softwareDevelop software solutions by studying information needs,studying systems flow, data usage and work processesInvestigating problem areas followed by the software developmentlife cycleFacilitate root cause analysis of the system issues and problemstatementIdentify ideas to improve system performance and impactavailabilityAnalyze client requirements and convert requirements to feasibledesignCollaborate with functional teams or systems analysts who carryout the detailed investigation into software requirementsConferring with project managers to obtain information onsoftware capabilitiesPerform coding and ensure optimal software/ moduledevelopment Determine operational feasibility by evaluating analysis,problem definition, requirements, software development and proposedsoftwareDevelop and automate processes for software validation by setting up and designing test cases/scenarios/usage cases, andexecuting these casesModifying software to fix errors, adapt it to new hardware,improve its performance, or upgrade interfaces.Analyzing information to recommend and plan the installation ofnew systems or modifications of an existing systemEnsuring that code is error free or has no bugs and test failurePreparing reports on programming project specifications,activities and statusEnsure all the codes are raised as per the norm defined forproject / program / account with clear description and replicationpatternsCompile timely, comprehensive and accurate documentation andreports as requestedCoordinating with the team on daily project status and progressand documenting itProviding feedback on usability and serviceability, trace theresult to quality risk and report it to concerned stakeholdersStatus Reporting and Customer Focus on an ongoing basis withrespect to project and its executionCapturing all the requirements and clarifications from theclient for better quality workTaking feedback on the regular basis to ensure smooth and ontime deliveryParticipating in continuing education and training to remaincurrent on best practices, learn new programming languages, and betterassist other team members.Consulting with engineering staff to evaluate software-hardwareinterfaces and develop specifications and performance requirementsDocument and demonstrate solutions by developing documentation,flowcharts, layouts, diagrams, charts, code comments and clear codeDocumenting very necessary details and reports in a formal wayfor proper understanding of software from client proposal toimplementation Ensure good quality of interaction with customer w.r.t. e-mailcontent, fault report tracking, voice calls, business etiquette etcTimely Response to customer requests and no instances ofcomplaints either internally or externally\n\nStakeholder Interaction\n\nStakeholder Type\n\nStakeholder Identification\n\nPurpose of Interaction\n\nInternal\n\nLead Software Developer and Project Manager\n\nRegular reporting & updates\n\nSoftware Developers \n\nFor work coordination and support in providing testing solutions\n\nExternal\n\nClients\n\nProvide apt solutions and support as per the requirement\n\n \n\n \n\nDisplay\n\nLists the competencies required to perform this role effectively:Functional Competencies/ SkillLeveraging Technology – Knowledge of current and upcomingtechnology along with expertise in programming (automation, tools andsystems) to build efficiencies and effectiveness in own function/ Clientorganization – CompetentProcess Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk – ExpertTechnical knowledge – knowledge of various programminglanguages, tools, quality management standards and processes - Expert\n\nCompetency Levels\n\nFoundation\n\nKnowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance.\n\nCompetent\n\nConsistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well.\n\nExpert\n\nApplies the competency in all situations and is serves as a guideto others as well.\n\nMaster\n\nCoaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognised within the entire organization.\n\n \n\n Behavioral CompetenciesFormulation & PrioritizationInnovationManaging ComplexityExecution ExcellencePassion for Results\n\nDeliver\n\nNo.\n\nPerformance Parameter\n\nMeasure\n\nContinuous Integration, Deployment & Monitoring of Software\n\n100% error free on boarding & implementation, throughput %,Adherence to the schedule/ release plan\n\nQuality & CSAT\n\nOn-Time Delivery, Manage software, Troubleshoot queries\n\nCustomer experience, completion of assigned certifications for skillupgradation\n\nMIS & Reporting\n\n100% on time MIS & report generation\n\nNET",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer II",
    "companyName": "Precisely",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Precisely is the leader in data integrity. We empower businesses to make more confident decisions based on trusted data through a unique combination of software, data enrichment products and strategic services. What does this mean to you? For starters, it means joining a company focused on delivering outstanding innovation and support that helps customers increase revenue, lower costs and reduce risk. In fact, Precisely powers better decisions for more than 12,000 global organizations, including 99 of the Fortune 100. Precisely's 2500 employees are unified by four company core values that are central to who we are and how we operate: Openness, Determination, Individuality, and Collaboration. We are committed to career development for our employees and offer opportunities for growth, learning and building community. With a \"work from anywhere\" culture, we celebrate diversity in a distributed environment with a presence in 30 countries as well as 20 offices in over 5 continents. Learn more about why it's an exciting time to join Precisely!\nIn this role, you will be responsible for designing, building, and deploying applications in our next-gen Data Integrity Suite platform based on k8’s. You will work closely with Software engineers, data scientists, and product managers to develop and deploy data-driven solutions that deliver business value.\nYou Will\n4-6 years of relevant software development experience with proven track record in SaaS ecosystem OR 8+ year of experience in traditional Software development life cycle.Bachelors and/or master’s in computer science, Engineering, or related field preferred.Strong fundamentals in data structures, algorithms, and complexity analysis.Strong experience in Big Data application development and deployment on EMR, Data Bricks , Snowflake and other cloud data platforms.Proficient developing software in one or more programming languages - Java (8 or above), Scala, C++, PythonExperience building production quality RESTful APIs OR/AND SOAP AND/OR graphql on reactive frameworks.Well versed with advanced programming concepts such as multi-threading, memory management, and query processing.Experience with relational databases like MySQl,postgres,Experience with Docker, kubernetes, CI/CDProven grasp of coding best practices and be able to write unit-testable code.\nYou Have\nExperience with Test-Driven Development (TDD) - Own your code or service components.Experience with cloud-native development (AWS, Azure, GCP etc.)Experience working in an agile development environmentStrong understanding of the nuances of CI/CD.Strong exposure on Big Data technology stack to help achieve bulk operations.\nPreferred Requirements\nExperience visualizing/presenting data for stakeholders using: Qlik, D3, ggplot, etc.Experience in deploying ML solutions,Experience with cloud-native development (AWS, Azure, GCP etc.)Experience in Data-Integrity domain - geo-spatial , Data quality , Enrich etc is a Big plus.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer II",
    "companyName": "Precisely",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Precisely is the leader in data integrity. We empower businesses to make more confident decisions based on trusted data through a unique combination of software, data enrichment products and strategic services. What does this mean to you? For starters, it means joining a company focused on delivering outstanding innovation and support that helps customers increase revenue, lower costs and reduce risk. In fact, Precisely powers better decisions for more than 12,000 global organizations, including 99 of the Fortune 100. Precisely's 2500 employees are unified by four company core values that are central to who we are and how we operate: Openness, Determination, Individuality, and Collaboration. We are committed to career development for our employees and offer opportunities for growth, learning and building community. With a \"work from anywhere\" culture, we celebrate diversity in a distributed environment with a presence in 30 countries as well as 20 offices in over 5 continents. Learn more about why it's an exciting time to join Precisely!\nIn this role, you will be responsible for designing, building, and deploying applications in our next-gen Data Integrity Suite platform based on k8’s. You will work closely with Software engineers, data scientists, and product managers to develop and deploy data-driven solutions that deliver business value.\nYou Will\n4-6 years of relevant software development experience with proven track record in SaaS ecosystem OR 8+ year of experience in traditional Software development life cycle.Bachelors and/or master’s in computer science, Engineering, or related field preferred.Strong fundamentals in data structures, algorithms, and complexity analysis.Strong experience in Big Data application development and deployment on EMR, Data Bricks , Snowflake and other cloud data platforms.Proficient developing software in one or more programming languages - Java (8 or above), Scala, C++, PythonExperience building production quality RESTful APIs OR/AND SOAP AND/OR graphql on reactive frameworks.Well versed with advanced programming concepts such as multi-threading, memory management, and query processing.Experience with relational databases like MySQl,postgres,Experience with Docker, kubernetes, CI/CDProven grasp of coding best practices and be able to write unit-testable code.\nYou Have\nExperience with Test-Driven Development (TDD) - Own your code or service components.Experience with cloud-native development (AWS, Azure, GCP etc.)Experience working in an agile development environmentStrong understanding of the nuances of CI/CD.Strong exposure on Big Data technology stack to help achieve bulk operations.\nPreferred Requirements\nExperience visualizing/presenting data for stakeholders using: Qlik, D3, ggplot, etc.Experience in deploying ML solutions,Experience with cloud-native development (AWS, Azure, GCP etc.)Experience in Data-Integrity domain - geo-spatial , Data quality , Enrich etc is a Big plus.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Computer Programmer 2",
    "companyName": "GP Strategies Corporation",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Summary\nThe dynamic IT environment created by changing business needs and shifting technology capabilities requires continuous management of software solutions to protect and expand their value. The Application Support Engineer role is critical to addressing these emergent issues and demands for changes in software solutions that preserve the investment in and value generated by key corporate business systems. The Application Support Engineer role is focused on a proactive support model for critical corporate applications within the GP Strategies organization.\nTraining in specific technical areas is provided through team-base knowledge transfer and upskilling so that Application Support Engineers have the capabilities to affect positive outcomes for the health and stability of business systems they manage.\nIn addition, the Application Support Engineer’s close work with application developers can provide opportunities for advancement into more advanced areas of application administration and development.\nEssential Duties/responsibilities MonitorInspects performance, reliability, security and costs of various corporate applications and platformsDevelops monitoring analytics to detect emerging application issues before they impact system usersRaises critical issues to developers and ITS managementTroubleshootingHandle escalated Service Desk incidents to resolve user and application functional and performance issuesSupport and adviseEngage users, SMEs and Product Owners to improve adoption, effectiveness and knowledgeDevelop basic job aides and knowledge resources for application usersInform development teams on optimizations based on user feedback and lessons learnedEnhance and configureHandle application Service Requests that require administrative accessPerform basic application enhancements to address time-sensitive business needs\nRequired Skills/experience\nUnderstanding of and facility with modern web-based business applications.Ability to perform root-cause analysis on IT systems technical and user issues.Excellent English skills (spoken and written)Excellent organizational and communications ability; ability to present technical information to non-technical audiencesAbility to work independently and within a team settingComfortable working with senior executives and staff\nPreferred Skills/experience Bachelors degree or equivalentCompetency in multiple languagesSpecific TechnologiesMicrosoft SharePoint OnlineMicrosoft Power PlatformPower Apps (Model and Canvas)Power AutomatePower BIMicrosoft DynamicsAzure Paas and Iaas, specifically:Azure storage accounts, included Data LakeAzure DatabricksAzure Data FactoryAzure Function AppsAzure Logic Apps\nPrimary Location\nIN-TN-Chennai\nWork Locations\nINDChennai\nJob\nTechnical and Professional\nOrganization\nIND 204 GPS India\nSchedule\nRegular\nJob Type\nFull-time\nJob Posting\nMar 15, 2023, 3:52:59 AM",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "HERE Technologies",
    "location": "Mumbai, Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  What's the role? \nAs a Senior Software Engineer in Foundation Engineering, you will work self-sustained in an agile team. Your responsibilities will cover developing, extending, and maintaining tools and services that process data for HERE global databases.\nYour Tasks\n Implement tools to enhance both automated and semi-automated map data processing, involving backend/service-based software stacks, but also dashboard components for data tracking and analysis  Own and drive technical excellence and in-depth solutions in an innovative and fast-paced environment  Apply and extended CI/CD tools and execute end-2-end ownership of your developed software stack, including DevOps and testing aspects  Work closely with other full stack and frontend engineers on the team to de/-refine APIs and system integrations  Work with other engineering teams and internal customers to identify new opportunities, address critical needs, and solve complex problems using your backend development expertise  Become an expert at leveraging internal platform resources and APIs  Drive initiatives that contribute to development of software that is efficient, reusable and reliable (e.g. agile, coding, verification)  Be part of an agile team, share knowledge, and carry out code reviews. \n Who are you? \n Bachelor's or master’s degree in Computer Science/Information Systems or equivalent  5+ years of software development experience,  Excellent applied skills in Java and/or Scala programming, in combination with backend architectures, messaging technology,gies, and related frameworks  Cloud Experience (AWS/Azure/IBM/Oracle)  Strong and applied experience in REST-based web service technologies, JSON and XML, SOA, and microservices architectures  Strong and applied DBMS & SQL skills, with a strong preference for PostgreSQL / PostGIS  Strong and applied AWS skills (EC2, S3, RDS,), as well as experience with virtualization tools like Docker  Strong experience with CI/CD tools, with a preference for Jenkins  Good knowledge of using issue tracking tools (e.g., JIRA), code collaboration tools (e.g., Git/GitLab), and team collaboration tools (e.g., Confluence/Wiki).  Good knowledge of Linux/Unix – familiar with shell scripting  Able to translate business and architectural features into quality, consistent software design  Solid knowledge of programming practices, striving to write great code that is reusable, flexible, and reliable.  Strong quality mindset is considered a must: unit testing, performance testing, writing testable code  Self-motivated, well-organized, details-oriented, and a strong team player with an agile mindset \nHERE is an equal-opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\n Who are we? \nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity, and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us. Watch Video\nHERE is searching for a Senior Software Engineer for our Foundation Engineering team. Foundation Engineering enables the creation of mapping products that are highly available, performant, and near real-time. The Senior Software Engineer will be a contributor on the team to deliver digital maps to major automakers, e.g. BMWs, VWs, Audi, and Daimler. You will work on a technology to collect and process road information from many sources, terabytes of data, including car sensors from millions of cars on the road. Our services convert this input into a digital map which is delivered back to the cars and used for navigation, driver assistance, and even autonomous driving. Developers building new services will rapidly launch their differentiated prototypes leveraging templates that enforce security, availability, and efficiency best practices with a minimal collection of service-specific libraries.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "HERE Technologies",
    "location": "Mumbai, Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  What's the role? \nAs a Senior Software Engineer in Foundation Engineering, you will work self-sustained in an agile team. Your responsibilities will cover developing, extending, and maintaining tools and services that process data for HERE global databases.\nYour Tasks\n Implement tools to enhance both automated and semi-automated map data processing, involving backend/service-based software stacks, but also dashboard components for data tracking and analysis  Own and drive technical excellence and in-depth solutions in an innovative and fast-paced environment  Apply and extended CI/CD tools and execute end-2-end ownership of your developed software stack, including DevOps and testing aspects  Work closely with other full stack and frontend engineers on the team to de/-refine APIs and system integrations  Work with other engineering teams and internal customers to identify new opportunities, address critical needs, and solve complex problems using your backend development expertise  Become an expert at leveraging internal platform resources and APIs  Drive initiatives that contribute to development of software that is efficient, reusable and reliable (e.g. agile, coding, verification)  Be part of an agile team, share knowledge, and carry out code reviews. \n Who are you? \n Bachelor's or master’s degree in Computer Science/Information Systems or equivalent  5+ years of software development experience,  Excellent applied skills in Java and/or Scala programming, in combination with backend architectures, messaging technology,gies, and related frameworks  Cloud Experience (AWS/Azure/IBM/Oracle)  Strong and applied experience in REST-based web service technologies, JSON and XML, SOA, and microservices architectures  Strong and applied DBMS & SQL skills, with a strong preference for PostgreSQL / PostGIS  Strong and applied AWS skills (EC2, S3, RDS,), as well as experience with virtualization tools like Docker  Strong experience with CI/CD tools, with a preference for Jenkins  Good knowledge of using issue tracking tools (e.g., JIRA), code collaboration tools (e.g., Git/GitLab), and team collaboration tools (e.g., Confluence/Wiki).  Good knowledge of Linux/Unix – familiar with shell scripting  Able to translate business and architectural features into quality, consistent software design  Solid knowledge of programming practices, striving to write great code that is reusable, flexible, and reliable.  Strong quality mindset is considered a must: unit testing, performance testing, writing testable code  Self-motivated, well-organized, details-oriented, and a strong team player with an agile mindset \nHERE is an equal-opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\n Who are we? \nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity, and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us. Watch Video\nHERE is searching for a Senior Software Engineer for our Foundation Engineering team. Foundation Engineering enables the creation of mapping products that are highly available, performant, and near real-time. The Senior Software Engineer will be a contributor on the team to deliver digital maps to major automakers, e.g. BMWs, VWs, Audi, and Daimler. You will work on a technology to collect and process road information from many sources, terabytes of data, including car sensors from millions of cars on the road. Our services convert this input into a digital map which is delivered back to the cars and used for navigation, driver assistance, and even autonomous driving. Developers building new services will rapidly launch their differentiated prototypes leveraging templates that enforce security, availability, and efficiency best practices with a minimal collection of service-specific libraries.",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Fullstack Developer",
    "companyName": "Deloitte",
    "location": "Mumbai, Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  Position Summary\n\n Job title:  Full Stack Developer – Senior Consultant (LSA/SSA)\n\nAbout\n\nAt Deloitte, we do not offer you just a job, but a career in the highly sought-after risk Management field. We are one of the business leaders in the risk market. We work with a vision to make the world more prosperous, trustworthy, and safe. Deloitte’s clients, primarily based outside of India, are large, complex organizations that constantly evolve and innovate to build better products and services. In the process, they encounter various risks and the work we do to help them address these risks is increasingly important to their success—and to the strength of the economy and public security.\n\nBy joining us, you will get to work with diverse teams of professionals who design, manage, and implement risk-centric solutions across a variety of domains. In the process, you will gain exposure to the risk-centric challenges faced in today’s world by organizations across a range of industry sectors and become subject matter experts in those areas.\n\nOur Risk and Financial Advisory services professionals help organizations effectively navigate business risks and opportunities—from strategic, reputation, and financial risks to operational, cyber, and regulatory risks—to gain competitive advantage. We apply our experience in ongoing business operations and corporate lifecycle events to help clients become stronger and more resilient. Our market-leading teams help clients embrace complexity to accelerate performance, disrupt through innovation, and lead in their industries. We use cutting-edge technology like AI/ML techniques, analytics, and RPA to solve Deloitte’s clients‘ most complex issues. Working in Risk and Financial Advisory at Deloitte US-India offices has the power to redefine your ambitions.\n\n The Team \n\n Accounting & Internal Controls \n\nWe help clients address issues and risks in accounting advisory services, financial reporting requirements, internal audit risk management, assurance needs, and internal controls services. We provide assistance on compliance, advise on critical business issues, and not only anticipate but navigate through each risk and opportunity with the client.\n\nOur Financial Technology practice develops and licenses a growing family of proprietary software products (see http://www.deloitte.com/ft) to assist financial institutions with a number of complex topics, such as accounting for credit deteriorated assets and the administration of investments in leveraged loans. We are looking to add to our Solvas|Digitize™ ( www.solvasdigitize.com ) and Solvas|Asset Management™ ( www.solvassoftware.com ) solution teams.\n Solvas|Digitize is an intelligent automation solution and managed service that is experiencing rapid growth and expansion across various industries and applications. Solvas|Asset Management is a suite of solutions including Solvas|Portfolio™, Solvas|Agent™, Solvas|Compliance™, and Solvas|PoP™ for the various needs of administrator, trustee, agent, and asset manager clients in the collateralized loan/debt obligations (CLOs/CDOs), credit funds, and syndicated loan markets.\n Work you’ll do \n Collaborate with product team members to fully understand business requirements and create clear functionalspecifications. Monitortheprogressandstatusoftasksanddeliverablesonprojectsandescalateissuesandrisksinatimely manner. Contribute to the delivery, implementation, and improvement of all applicable processes and methodologies. Analyze and implement user requirements/business needs as new and/or enhanced product functionality Design, code, test, and document software code Assist in the packaging and delivery of finished software products to clients Communicate with technical and business leaders on business requirements, system-related capabilities, programming progress, and enhancement status Work with other teams to develop good understanding of overall business process and make sure final development effort meets real life requirements Lead and mentor junior developers to advance best practices and overall development skills Contribute to a positive team attitude\nRequired Skills\n Ability to work independently and multitask in a fast-paced environment to meet client deadlines Strong technical, organizational, analytical skills, problem-solving skills and high attention to detail Highly developed written and strong oral communication skills to express ideas and collaborate with the team Flexibility in working hours according to business needs Experience developing web-based client/server applications built with React, ECMAscript (Javascript), TypeScript and C# Strong understanding of OOP concepts, architecture, and design Exposure to OOP in JavaScript and prototypal inheritance Experience working with Microsoft’s .NET Framework (C# language) Working skills with Microsoft SQL Server (including programming stored procedures and functions in T- SQL) Hands-on software engineering development experience Experience working in an Agile development environment\nPreferred Skills\n Knowledge of RESTful API services Experience with microservice based architectures Exposure to Git, Azure DevOps (previouslyVSTS) Experience in Cloud Deployment (Microsoft Azure, Amazon WebServices) Understanding of containers (Kubernetes) Exposure to MongoDB\n Qualification \n B.Tech/M.Tech\n#CA-SS\n\n Recruiting tips \n\nFinding the right job and preparing for the recruitment process can be tricky. Check out tips from our Deloitte recruiting professionals to set yourself up for success. Check out recruiting tips from Deloitte recruiters .\n\nBenefits\n\nWe believe that to be an undisputed leader in professional services, we should equip you with the resources that can make a positive impact on your well-being journey. Our vision is to create a leadership culture focused on the development and well-being of our people. Here are some of our benefits and programs to support you and your family’s well-being needs. Learn more about what working at Deloitte can mean for you .\n\n Our people and culture \n\nOur people and our culture make Deloitte a place where leaders thrive. Get an inside look at the rich diversity of background, education, and experiences of our people. What impact will you make? Be inspired by the stories of our people .\n\n Our purpose \n\nDeloitte’s purpose is to make an impact that matters for our clients, our people, and in our communities. We are creating trust and confidence in a more equitable society. At Deloitte, purpose is synonymous with how we work every day. It defines who we are. We are focusing our collective efforts to advance sustainability, equity, and trust that come to life through our core commitments. Learn more about Deloitte's purpose, commitments, and impact .\n\n Professional development \n\nYou want to make an impact. And we want you to make it. We can help you do that by providing you the culture, training, resources, and opportunities to help you grow and succeed as a professional. Learn more about our commitment to developing our people .\n\nRequisition code: 141754",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer-RMS",
    "companyName": "Alshaya Group",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  About Alshaya:\nAlshaya Group is a dynamic family-owned enterprise, first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering an unparalleled choice of well-loved international brands to customers.\nAlshaya Group’s portfolio extends across MENA, Turkey and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to authentically deliver great customer service and brand experiences.\nFresh, modern and relevant, Alshaya’s constantly evolving portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, through to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be. Brands such as Starbucks, H&M, Mothercare, Debenhams, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Pottery Barn and KidZania.Role Profile:The Senior Software Engineer will be responsible for leading the implementation of the Oracle RMS system (RMS, RPM, ReiM and RESA). This includes configuration, customization, testing, and deployment of the system.The below Key Performance Areas include but are not limited to:· Work experience of 5+ year on any of those modules RMS, RPM, ReiM and RESA.· Work with Business Analysts to define technical requirements for the new changes. · Clarifies technical requirements and influences decisions that lead to the right solutions.· Prepare technical designs (diagrams and flows) documents for modifications and integrations.· Takes personal responsibility for the quality and timeliness of work .· Flexible and able to work effectively in a fast-paced environment.Knowledge (Desired):· Bachelor’s degree in Information Systems, Computer Science or related field strongly preferred. · Experience in Oracle retail implementations(RMS, RPM, ReiM and RESA) : 5+ year exp· Sound knowledge of the Systems Development Life Cycle (SDLC) methodology.Experience:· Experience with RMS, RPM, ReiM and RESA : 5-7 years· PL SQL: 5-7 years · Shell Script: 5-7 years",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer-RMS",
    "companyName": "Alshaya Group",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  About Alshaya:\nAlshaya Group is a dynamic family-owned enterprise, first established in Kuwait in 1890. With a consistent record of growth and innovation, Alshaya Group is one of the world’s leading brand franchise operators, offering an unparalleled choice of well-loved international brands to customers.\nAlshaya Group’s portfolio extends across MENA, Turkey and Europe, with thousands of stores, cafes, restaurants and leisure destinations, as well as a growing online and digital business.\nOperating in multiple sectors including Fashion, Food, Health & Beauty, Pharmacy, Home Furnishings and Leisure & Entertainment, Alshaya Group colleagues are united by a commitment to authentically deliver great customer service and brand experiences.\nFresh, modern and relevant, Alshaya’s constantly evolving portfolio reflects the choices and lifestyle of its customers. From flagship stores and restaurants in prestige malls, through to local coffee shops, drive-thrus and online, Alshaya Group brings customers the brands they love in the places they want to be. Brands such as Starbucks, H&M, Mothercare, Debenhams, American Eagle Outfitters, P.F. Chang’s, The Cheesecake Factory, The Body Shop, M.A.C, Victoria’s Secret, Boots, Pottery Barn and KidZania.Role Profile:The Senior Software Engineer will be responsible for leading the implementation of the Oracle RMS system (RMS, RPM, ReiM and RESA). This includes configuration, customization, testing, and deployment of the system.The below Key Performance Areas include but are not limited to:· Work experience of 5+ year on any of those modules RMS, RPM, ReiM and RESA.· Work with Business Analysts to define technical requirements for the new changes. · Clarifies technical requirements and influences decisions that lead to the right solutions.· Prepare technical designs (diagrams and flows) documents for modifications and integrations.· Takes personal responsibility for the quality and timeliness of work .· Flexible and able to work effectively in a fast-paced environment.Knowledge (Desired):· Bachelor’s degree in Information Systems, Computer Science or related field strongly preferred. · Experience in Oracle retail implementations(RMS, RPM, ReiM and RESA) : 5+ year exp· Sound knowledge of the Systems Development Life Cycle (SDLC) methodology.Experience:· Experience with RMS, RPM, ReiM and RESA : 5-7 years· PL SQL: 5-7 years · Shell Script: 5-7 years",
    "link": "https://www.linkedin.com/jobs/view/3531020349/?eBP=CwEAAAGHHGUMe-96rC7GmCDEGjpqnb1YNtabjgXlMmWd7ANWpHaKsF3zNwdBhDkXJP5uLpaPn7CMuOxlTeoiOClI_RUkw-1uZ6Eqfg1w8OW0qaLhtHb5uDhJ0I8OBoAjXHHvXhYy_JZsdZouKKij4H8iXYpcQ3leVHAwWBxf3YwW3TsOTlb60KuZCGkf9R6rbzLIynCCf7Qhw-faGbJhp4FNh99WQ0BEd8_hT5UHqh532p27MIXlm-4DByv_IkFgEVUuu4c1LmtCBqKmaI4kOTGPXQteSVP6QJ4yLXUzEs4uQf7bA07n6Sn0gR2Ecnbao8pJBHreiaelQUxnt4lS4lMtHlNLLJGYRChJ&recommendedFlavor=SCHOOL_RECRUIT&refId=CMNUsmvNKAwbD6WNfXo3Eg%3D%3D&trackingId=DmclM99arN8tSSpl3Oz5qg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  }
]